{
  "characterName": "Bluey Christine Heeler",
  "description1": "Bluey is a seven-year-old Blue Heeler pup who loves to play. Her parents and teacher give her lots of time to practice, which means she’s become very good at inventing games, helping everyone choose their roles and deciding on the rules. Her favourite games are ones that involve lots of other kids and grown-ups (especially her dad) and she likes to pretend she’s a grown-up doing grownup things herself.",
  "decription2": "Bluey Christine Heeler is the titular protagonist, daughter of Bandit and Chilli, the older sister of Bingo, and niece of Uncle Stripe and Aunt Trixie.",
  "catchphrase": "For real life?!",
  "appearance": "Bluey is a Blue Heeler with light blue, blue, dark blue and tan fur. She has a rectangular shaped body, and has light blue paws, outer muzzle, eyebrows and chest, blue legs, arms, torso, head and tail stem, dark blue torso spots, tail tip, outer ears and head spots, and tan inner ears and muzzle. She also has a black nose.",
  "personality": "Bluey, in general, is an energetic character who loves to play, as described on the official page. She can be a bit too bossy when she plays games, as seen in the Magic Xylophone episode and some other episodes. She can be easily distracted as seen in Hide and Seek. She really likes to play with her friends too.",
  "nicknames": [
    "Piano",
    "Ding Dongs",
    "Garden Gnome",
    "Doctor",
    "Janet",
    "Barnicus",
    "Dennis",
    "Rhonda",
    "Marjory",
    "Karen",
    "Margaret"
  ],
  "characteristics": {
    "breed": "Blue Heeler",
    "gender": "Female",
    "age": ["6", "7", "19"]
  },
  "traits": {
    "eyes": "Black",
    "fur": "Light blue, blue, dark blue and tan"
  },
  "personal_status": {
    "relatives": [
      "Bandit Heeler",
      "Chilli Heeler",
      "Bingo",
      "Radley",
      "Frisky",
      "Brandy",
      "Stripe",
      "Trixie",
      "Muffin",
      "Socks",
      "Bob",
      "Nana",
      "Mort",
      "Mrs. Cattle"
    ],
    "friends": [
      "Lucky",
      "Rusty",
      "Indy",
      "Coco",
      "Snickers",
      "Honey",
      "Mackenzie",
      "Chloe",
      "Judo",
      "Jean-Luc",
      "Winton",
      "Buddy",
      "The Terriers",
      "Pretzel",
      "Bentley",
      "Winnie",
      "Fido",
      "Mia",
      "Hercules",
      "Pom Pom",
      "Maynard",
      "Jack",
      "Missy"
    ]
  },
  "firstAppearance": "The Magic Xylophone",
  "trivia": [
    "Being the main protagonist, Bluey has never made an absence on any episode, except Turtleboy",
    "She has only been absent in four shorts, namely Pea Pod Sausages, Green Bottles, Mower and Honk.",
    "Viewer gender confusion: Bluey has frequently been mistaken as a male by many viewers, mainly due to her looking like her father, having some traits of a young boy and her being blue, a stereotypical boy color. In fact, when the show first aired, nearly all initial viewers assumed Bluey and Bingo were male, as their gender had not been said in the first few episodes, though a few episodes later, it was stated that Bluey and Bingo were female dogs. Even after this, many people who have only seen small things from the show tend to think Bluey is a boy, it has even got to the point where plush toys of Bluey nearly always get put in the boys toys aisle of stores, and in some cases, the plush is even straight up listed as a boy dog plush in online listings of it. The confusion was further fueled in Kids, when a cashier says to Bluey, 'What a nice young boy you have there!' (refering to Bandit), as many people believed that the cashier was talking to Bandit. This is later referenced in a few episodes, in Double Babysitter when Uncle Rad said, 'cause he's blue,' after which Bluey corrects him, saying that she is a girl.",
    "Bluey's favourite animal is fruit bat, as seen in Fruit Bat.",
    "Bluey's favourite colour of capsicum (bell pepper) is yellow, as mentioned in the episode BBQ.",
    "Bluey's favourite breakfast is fruit salad, as mentioned in the episode Fruit Bat.",
    "Bluey's older version can be seen at the end of episode Camping.",
    "Bluey's family is the first to have a known surname.",
    "Bluey once played as a cameo, as seen on episode Army.",
    "Bluey and Bingo have unlockable Emojis on the DisneyNOW app and website that can be used on the user's profile. These emojis use the art style of Disney Emoji Blitz, a match-3 puzzle game for mobile phones.",
    "She may be unable to read as seen in Takeaway and Bus, although in some episodes as well as in the short Crazy Christmas Lights, she can be seen presumably reading a book. However, she might just be looking at pictures.",
    "She is also intrigued by the fact that her buddy Mia can write, which could mean that she is unable to either.",
    "In Library, she can be seen reading aloud, which could mean that Bluey is starting to be able to read. Though again, she could just be trying to retell the story through the pictures.",
    "Throughout Bin Night, she is shown to have a white belt on an unspecified martial art.",
    "Later in the episode, she can be seen advanced to the yellow belt.",
    "Bluey plays the recorder, as shown in Queens and Bin Night.",
    "Baby Race features Bluey when she was still a baby.",
    "In Baby Race, Chilli confirms that Bluey is still two years older than Bingo, although she might just be approximating",
    "It is possible while Bingo's fifth birthday happened in Handstand, Bluey’s seventh birthday is shown in Pass the Parcel",
    "The long distance between her birthdays is somewhat noted by Bandit in Chest, being confused as to why Bluey is still six (she tells him she’s almost seven)",
    "In Burger Shop, it is mentioned that she is in preschool, more specifically a preparatory school as stated in Calypso's bio.",
    "In Jingle Bells short, this marks the first short where Bluey speaks.",
    "Bluey is the first charcter to have their middle name revealed",
    "In Family Meeting it is revealed her middle name is 'Christine'",
    "In the ABC Kids Listen app's Story Time promo, she briefly cameos as a drawing on a smartphone.",
    "Even though she has the physical appearance of a Blue Heeler, she is technically a Red/Blue crossbreed.",
    "It is likely that she is named after a real dog in Australia named Bluey, who lived to be nearly thirty years old and was the oldest dog to ever live. [see references]",
    "To protect their privacy and for 'safety reasons', the identity of Bluey's voice actor is kept a secret from the public unlike many other children's TV shows which reveal actual names of children actors and actresses. And to this day, their identity is still a mystery. The same also goes for the other voice actors for many of the other children, including Bluey's sister, Bingo.",
    "In Onesies, Bluey reveals that she does not like the fact that she looks similar to Bandit.",
    "According to [Family Tree - Part 3) picture] by user Aussie Girl Maggie, (which mentions Chili’s side of the Heeler family) apparently Bluey is stated to be nineteen before the end of Camping."
  ],
  "appearances": [
    "Army",
    "Silent Night",
    "Crazy Christmas Lights",
    "Jingle Bells",
    "The Lollipop Song"
  ],
  "absences": [
    "Turtleboy",
    "Pea Pod Sausages",
    "Green Bottles",
    "Mower",
    "Honk"
  ],
  "gallery": [
    "Artwork",
    "Bluey pilot design",
    "Bluey's pilot design",
    "BlueyArtwork03",
    "Artwork of Bluey cuddling Polly Puppy",
    "BlueyArtwork01",
    "Artwork of Bluey (Bad Chroma-Keying!)",
    "BlueyArtwork02",
    "Artwork of Bluey as seen on the DVD cover of Horsey Ride & Other Stories",
    "BlueyArtwork05",
    "Artwork of Bluey playing",
    "BlueyArtwork04",
    "Main artwork",
    "Bluey&BingoArtworkAlt",
    "Alternate artwork of Bluey and Bingo",
    "BlueyArtwork06",
    "Artwork of Bluey playing a game of Keepy-Uppy",
    "Bluey-TV-Series-ABC-Kids-Bluey-Character-waving",
    "Bluey waving",
    "BlueyIntroArtwork",
    "Bluey dancing in the intro",
    "Bluey img 5",
    "BlueyDisneyNowEmoji",
    "Bluey's DisneyNOW Emoji",
    "Bluey please face",
    "Bluey using her Please Face on her dad",
    "BlueyLTDDrawing",
    "Bluey's learn to draw drawing, as drawn by a storyboard artist at Ludo Studio.",
    "Rug",
    "Fdvds",
    "BlueyBingoEscape",
    "Bluey and Bingo as sketches as seen on Escape.",
    "BlueyinABCKids2018ChristmasCountdown",
    "Bluey in ABC Kids's 2018 Christmas countdown",
    "BlueyinABCKids2020ID",
    "Bluey in ABC Kids's Iview ident",
    "March",
    "Bluey Group photo  ",
    "The Pool-screen1",
    "Favourite-Thing7",
    "Favourite-Thing8",
    "Bingo: 'That's my favourite thing!'",
    "DoubleBabysitterPreview",
    "Bluey and Bingo with their babysitters Rad and Frisky",
    "Typewriter-Bluey doesn't make sense",
    "Grandad-Hiding  ",
    "Bluey hiding with her sister and grandfather",
    "MrMonkeyjocksPreview  ",
    "The Heelers with Mr. Monkeyjocks",
    "TheQuietGamePreview  ",
    "Bandit Heeler vs. the Mime Sisters!",
    "PostmanPreview  ",
    "CafePreview",
    "BurgerShopPreview  ",
    "Bluey and Bingo playing Burger Shop during bathtime",
    "BarkyBoatsPreview  ",
    "Libraryimage",
    "Bluey reading to Bingo, Muffin and some plushies",
    "Moviesimage  ",
    "Bluey MIGHT have cinephobia (fear of watching movies)",
    "Seesawimage  ",
    "Circus Sneakpeak",
    "Circus ringmaster, clown, lion tamer's wife, lion tamer, muscleman and lion putting on a show",
    "Bluey fluff hair",
    "Hedgehog Bluey",
    "BlueyinABCKids2020ChristmasCountdown",
    "Bluey in ABC Kids' revised 2020 Christmas Countdown",
    "BlueyABCKidsListenAppStoryTimePromoCameo",
    "Bluey as a drawing cameo in the ABC Kids Listen app's Story Time promo"
  ],
  "animated": [
    "Cookie",
    "Bluey and Bingo",
    "Wagon Ride",
    "'Monkey bars?'",
    "Bluey Crying",
    "Bluey - excited",
    "Bluey - dancing",
    "Bluey - laughing",
    "Bluey - shrug",
    "'Well, we'll have to see.'",
    "Bluey - thoughtful",
    "'I have an idea.'",
    "Bluey - excited2",
    "'It's Keepy Uppy!'",
    "BlueyFariesTaunt",
    "Bluey dancing in a fairy ring",
    "BlueyLaugh01",
    "BlueyRun",
    "'_giggles_ I'll get the speaker!'",
    "BlueySitting",
    "BlueyVictoryTaunt",
    "BlueyWithBook",
    "BlueyWithBook2",
    "'I know!'",
    "BlueyWave",
    "BlueyWave2",
    "'Hello.'",
    "BlueyCocoandSnickers",
    "Bluey, Snickers, and Coco cheering after winning Shadowlands",
    "BlueyConfusedidle",
    "BlueyConfusionidle",
    "BlueydepressedIdle",
    "BlueyHelp",
    "'Run!'",
    "BlueyIdea",
    "'Wait! I know.'",
    "Blueypoint",
    "Blueypoint2",
    "Blueypointbackward",
    "BlueyReadingBook",
    "'Yeah, it is.'",
    "BlueyTaunt",
    "BlueyThinkitThrough",
    "BlueyVictory",
    "'Yeah!'",
    "BlueyVictory2",
    "BlueyVictory3",
    "'Yeah, I was right! _makes sound_'",
    "BlueyandBingoTaunt",
    "'Yeah!'",
    "BlueyandBingoTaunt2",
    "BlueyandBingoTaunt3",
    "'Oooooh!'",
    "BlueyandBingoWave",
    "BlueyandBingoWave2",
    "BlueyandBingowithpuppet",
    "Blueywithcupcake",
    "DaddyDropoffgif5",
    "'Walkies!'",
    "DanceModegif2",
    "Bingo: 'I was still very hungry.'"
  ],
  "references": ["https://en.wikipedia.org/wiki/Bluey_(dog)"]
}
