[
  {
    "characterName": "Bluey Christine Heeler",
    "description1": "Bluey is a seven-year-old Blue Heeler pup who loves to play. Her parents and teacher give her lots of time to practice, which means she’s become very good at inventing games, helping everyone choose their roles and deciding on the rules. Her favourite games are ones that involve lots of other kids and grown-ups (especially her dad) and she likes to pretend she’s a grown-up doing grownup things herself",
    "description2": "Bluey Christine Heeler is the titular protagonist, daughter of Bandit and Chilli, the older sister of Bingo, and niece of Uncle Stripe and Aunt Trixie",
    "catchphrase": "For real life?",
    "appearance": "Bluey is a Blue Heeler with light blue, blue, dark blue and tan fur. She has a rectangular shaped body, and has light blue paws, outer muzzle, eyebrows and chest, blue legs, arms, torso, head and tail stem, dark blue torso spots, tail tip, outer ears and head spots, and tan inner ears and muzzle. She also has a black nose",
    "personality": "Bluey, in general, is an energetic character who loves to play, as described on the official page. She can be a bit too bossy when she plays games, as seen in the Magic Xylophone episode and some other episodes. She can be easily distracted as seen in Hide and Seek. She really likes to play with her friends too.",
    "nicknames": "Piano, Ding Dong, Garden Gnome, Doctor, Janet, Barnicus, Dennis, Rhonda, Marjory, Karen, Margaret",
    "breed": "Blue Heeler",
    "gender": "Female",
    "age": "6, 7, 19",
    "eyes": "Black",
    "fur": "Light blue, blue, dark blue and tan",
    "relatives": "Bandit Heeler, Chilli Heeler, Bingo, Radley, Frisky, Brandy, Stripe, Trixie, Muffin, Socks, Bob, Nana, Mort, Mrs. Cattle",
    "friends": "Lucky, Rusty, Indy, Coco, Snickers, Honey, Mackenzie, Chloe, Judo, Jean-Luc, Winton, Buddy, The Terriers, Pretzel, Bentley, Winnie, Fido, Mia, Hercules, Pom Pom, Maynard, Jack, Missy",
    "firstAppearance": "The Magic Xylophone",
    "trivia": "Being the main protagonist, Bluey has never made an absence on any episode, except Turtleboy,She has only been absent in four shorts, namely Pea Pod Sausages, Green Bottles, Mower and Honk.,Viewer gender confusion: Bluey has frequently been mistaken as a male by many viewers, mainly due to her looking like her father, having some traits of a young boy and her being blue, a stereotypical boy color. In fact, when the show first aired, nearly all initial viewers assumed Bluey and Bingo were male, as their gender had not been said in the first few episodes, though a few episodes later, it was stated that Bluey and Bingo were female dogs. Even after this, many people who have only seen small things from the show tend to think Bluey is a boy, it has even got to the point where plush toys of Bluey nearly always get put in the boys toys aisle of stores, and in some cases, the plush is even straight up listed as a boy dog plush in online listings of it. The confusion was further fueled in Kids, when a cashier says to Bluey, 'What a nice young boy you have there!' (refering to Bandit), as many people believed that the cashier was talking to Bandit. This is later referenced in a few episodes, in Double Babysitter when Uncle Rad said, 'cause he's blue,' after which Bluey corrects him, saying that she is a girl.,Bluey's favourite animal is fruit bat, as seen in Fruit Bat.,Bluey's favourite colour of capsicum (bell pepper) is yellow, as mentioned in the episode BBQ.,Bluey's favourite breakfast is fruit salad, as mentioned in the episode Fruit Bat.,Bluey's older version can be seen at the end of episode Camping.,Bluey's family is the first to have a known surname.,Bluey once played as a cameo, as seen on episode Army.,Bluey and Bingo have unlockable Emojis on the DisneyNOW app and website that can be used on the user's profile. These emojis use the art style of Disney Emoji Blitz, a match-3 puzzle game for mobile phones.,She may be unable to read as seen in Takeaway and Bus, although in some episodes as well as in the short Crazy Christmas Lights, she can be seen presumably reading a book. However, she might just be looking at pictures.,She is also intrigued by the fact that her buddy Mia can write, which could mean that she is unable to either.,In Library, she can be seen reading aloud, which could mean that Bluey is starting to be able to read. Though again, she could just be trying to retell the story through the pictures.,Throughout Bin Night, she is shown to have a white belt on an unspecified martial art.,Later in the episode, she can be seen advanced to the yellow belt.,Bluey plays the recorder, as shown in Queens and Bin Night.,Baby Race features Bluey when she was still a baby.,In Baby Race, Chilli confirms that Bluey is still two years older than Bingo, although she might just be approximating,It is possible while Bingo's fifth birthday happened in Handstand, Bluey’s seventh birthday is shown in Pass the Parcel,The long distance between her birthdays is somewhat noted by Bandit in Chest, being confused as to why Bluey is still six (she tells him she’s almost seven),In Burger Shop, it is mentioned that she is in preschool, more specifically a preparatory school as stated in Calypso's bio.,In Jingle Bells short, this marks the first short where Bluey speaks.,Bluey is the first charcter to have their middle name revealed,In Family Meeting it is revealed her middle name is 'Christine',In the ABC Kids Listen app's Story Time promo, she briefly cameos as a drawing on a smartphone.,Even though she has the physical appearance of a Blue Heeler, she is technically a Red/Blue crossbreed.,It is likely that she is named after a real dog in Australia named Bluey, who lived to be nearly thirty years old and was the oldest dog to ever live. [see references],To protect their privacy and for 'safety reasons', the identity of Bluey's voice actor is kept a secret from the public unlike many other children's TV shows which reveal actual names of children actors and actresses. And to this day, their identity is still a mystery. The same also goes for the other voice actors for many of the other children, including Bluey's sister, Bingo.,In Onesies, Bluey reveals that she does not like the fact that she looks similar to Bandit.,According to [Family Tree - Part 3) picture] by user Aussie Girl Maggie, (which mentions Chili’s side of the Heeler family) apparently Bluey is stated to be nineteen before the end of Camping.",
    "absences": "Turtleboy, Pea Pod Sausages, Green Bottles, Mower, Honk",
    "gallery": "",
    "animated": "",
    "references": "en.wikipedia.org/wiki/Bluey_(dog)"
  },
  {
    "characterName": "Bingo Heeler",
    "description1": "Bingo is Bluey's younger sister. She’s 4 years old, and a red heeler like her mum. Bingo also likes to play but she is a bit quieter than Bluey, so is more likely to be the customer than the shop owner. Sometimes though, when Bluey asks her to be the doctor, rather than the patient, she really enjoys it. When she’s not playing you can find her in the yard talking to tiny bugs or off lost in her own beautiful world.",
    "description2": "Bingo Heeler is one of the main characters of Bluey. Serving the role as a deuteragonist, she is the younger daughter of Bandit and Chilli, the younger sister of Bluey, and niece of Stripe, Trixie, Rad, and Brandy.",
    "catchphrase": "This is confusing.",
    "appearance": "Bingo is a Red Heeler with light cream, orange and dark orange fur. She has cream feet, hands, tail tip, chest, muzzle and eyebrows, orange legs, arms, tail stem, torso and inner ears, and a dark orange tail spot, back spot, left and right head and outer ears. She also has a brown nose.",
    "personality": "Bingo is a character that loves to play. She's rather on the passive side and often depends on her older sister when playing as mentioned on the official page and seen on many episodes such as Hairdressers. She likes to observe tiny bugs as seen on episodes such as The Weekend and Bingo. She doesn't like to play rough as seen on episode Yoga Ball. She's smart and has broad knowledge of everyday things as seen on episodes Fruitbat and The Dump. She can get heartbroken when people or Bluey make fun of her or when she thinks they are making fun of her, as seen in Favourite Thing.",
    "nicknames": "Slobberdobber, Snowdro, Sparklesho, Tap Gir, Lar, Rit, Cassiopei, Snowdro, Sharaland, Dr. Glend, Merifyndor",
    "breed": "Red Heeler",
    "gender": "Female",
    "age": "4, 5",
    "eyes": "Black",
    "fur": "Orange, dark orange and cream",
    "relatives": "Bandit, Chilli, Bluey, Radley, Brandy, Stripe, Trixie, Muffin, Socks, Bob, Chris, Mort, Mrs. Cattle",
    "friends": "Lucky, Indy, Coco, Snickers, Honey, Mackenzie, Chloe, Judo, Rusty, Buddy, Juniper, Bentley, Missy, Lila, Maynard, Frisky, Jasper, Harley, Hercules, Winton",
    "firstAppearance": "The Magic Xylophone",
    "trivia": "It is currently shown that Bingo can only count to fourteen as seen in Hide and Seek., Bingo and Socks, Bluey and Muffin's little sisters, have so far not had their middle names revealed., Bingo has her own dedicated episode of the same name in season 2., It is often shown that Lila is Bingo's best friend, which started through Lilas' first day at Kindergarten in Daddy Dropoff., An older Bingo and Lila can also be seen at the end of the episode., Bingo speaks with a faint, but noticeable nasally voice., In some episodes, whenever she interacts with an insect, her close-ups are in 3D animation instead of 2D., She is the second character (after Chloe) who had their birthday and aged up in the series., In Sleepytime, Bingo was the second Bluey character that was pictured crying, instead of just tearing up., She is also pictured crying when she first loss in Pass the Parcel., Her favourite colour is blue as mentioned in Easter., In The Pool, Helicopter and Duck Cake, it has been mentioned that Bingo is taking ballet, gymnastics and mini-hockey respectively., While not as bad as her sister, Bingo often gets confused for a boy, since Bingo is usually a name for a male dog, and her voice can sometimes sound like a young boy. It helps, however, that Bingo looks a lot like her mother., In addition, there is a popular children's rhyme about another dog named Bingo, who is said to be male. In fact, nearly every other dog named Bingo, real or fictional is male., Bingo sometimes finds some games too rough, as mentioned in the episode Yoga Ball., However, this seems to have improved through later episodes in the show, such as Pirates., In season two, Bingo’s car seat has changed. In season one, she was in a lap-sash seat and the creators received feedback from fans saying she wasn’t big enough for that, so now she’s in a four-point harness seat., Bingo is very similiar in appearance to her aunt Brandy, as mentioned in Onesies.",
    "absences": "Shadowlands, Calypso, Shops, The Adventure, Early Baby, Mums and Dads, Army, Barky Boats, Octopus, Typewriter, Unicorse, Stories, Space",
    "gallery": "",
    "animated": "",
    "references": "Array"
  },
  {
    "characterName": "Bandit Heeler",
    "description1": "Dad is an archaeologist (he loves to dig up bones). As the devoted, yet tired father, he does his best to use whatever energy is left after interrupted sleep, work and household chores, to invent and play games with his two girls. He still tries to continue his own life amidst the chaos of childrearing but often struggles to juggle these two competing tasks!",
    "description2": "Bandit Heeler is a main character, the husband of Chilli, the younger brother of Rad, the older brother of Stripe, father of Bluey and Bingo, and uncle of Muffin and Socks.",
    "catchphrase": "Oh, biscuits!",
    "appearance": "Bandit is a Blue Heeler with blue, light blue, tan and black fur. He has light blue feet, hands, outer belly, outer muzzle and eyebrows, blue legs, arms, tail tip and torso, tan belly, muzzle and inner ears, and black tail stem, head and outer ears. He also has a black nose and beard whiskers on his muzzle.",
    "personality": "Bandit is a character that loves to play with his daughters. He will take his role in a game seriously even though he's often seen unwilling and reluctant whenever his daughters mention a game to play. While playing with his daughters, he often teaches them life lessons along the way.",
    "nicknames": "Bugalugs, Telemachus, Bert Handsome, Diddums, Romeo McFlourish, Shooby-Doowah,Bevan,Deep blue,Ooh-Ooh,Gallahop,Big Blue,Bandishwasher",
    "breed": "Blue Heeler",
    "gender": "Male ♂",
    "age": "42-45",
    "eyes": "Black",
    "fur": "Fur",
    "relatives": "Chilli (wife), Bluey (older daughter), Bingo (younger daughter), Bob (father), Chris (mother), Radley (older brother), Stripe (younger brother), Brandy (sister-in-law), Trixie (sister-in-law), Muffin (niece), Socks (niece), Mort (father-in-law), Mrs. Cattle (mother-in-law), Rodney (pet rock), Mary (Aunt)",
    "friends": "Pat, Frank, Chloe’s Mum, Marcus, Daisy, Wendy, Mackenzie’s Dad, Mackenzie’s Mum, Indy's Mum, Rocko, Fido, Lucky, Indy, Coco, Snickers, Honey, Mackenzie, Chloe, Judo, Rusty, Frisky, Winnie, Doreen, Rodney’s Pet Rock, Pom Pom",
    "firstAppearance": "The Magic Xylophone",
    "trivia": "He is voiced by Dave McCormack, the frontman of Australian '90s Indie rock band Custard. This is also the debut of McCormack in animated television, The next character to be voiced by a member of a band is Postie. He used to play touch football, as mentioned in Fruitbat. He wants to do it again, but has been too busy with parenting and his job. He likes to watch cricket, as seen in Horsey Ride & The Weekend. He likes to play squash, as seen in Squash. He burps after eating sauerkraut in the original dub of Chickenrat. However, in the Disney dub, he sneezes after eating sauerkraut. This could possibly mean he is allergic to sauerkraut. Another possibility is they simply changed it to be more family friendly for America. He loves bananas, but hates rockmelon (cantaloupe), as mentioned in Trampoline. He makes several “dad-jokes” to Bluey and Bingo as shown in a couple of episodes of Season 1, most notably in The Creek and The Pool. As of Season 2, he doesn’t do “dad-jokes” as much, but he still has his cheekiness in some episodes in Season 2. He is the only male member of the main cast. It is yet to be shown of where Bandit works. A younger version of him can be seen in the flashback of the episode Baby Race, wherein he lacks the hairs. Bandit farted at least in five episodes (as humour) in Daddy Robot, Fairies, Teasing,Family Meeting, and Smoochy Kiss, though this gag has decreased as of Season 2. Family Meeting reveals that baked beans, nut roast, and pie can all give him gas. Bandit can ride a skateboard as seen in Bob Bilby Bandit once peed in a pool as seen and said by Chilli in Swim School. He was claimed Dad of the Year in 2019. Bandit is often seen reading the newspaper in most episodes. Bandit’s child-friendly expletives are mostly food related phrases; Bandit says, “Oh, Biscuits!” in several episodes. He says, “Cheese and Crackers!” in Daddy Robot and Taxi. He also says, “Beans on Toast!” and “Goodness Gravy!” in Taxi. He says, “Bread and Jam!” in Tickle Crabs. He exclaims, “Oh, Duck Cake!” in Duck Cake. He says, “Crumbed Steak” in Road Trip. Before the title cards when Bluey and Bingo decide what game to play, Bandit says “Oh no, not [NAME OF GAME]” after Bluey and/or Bingo says the name of the game. He is left-handed, as revealed in The Claw. He will get cranky when he is hungry, as revealed in Omelette. A ten-year-old version of Bandit can be seen in Fairytale. Bandit is revealed to be the middle child in the same episode. In Fairytale, a cassette for the song Bad Medicine by Bon Jovi can be seen. This song was released in 1988, meaning that the events of Fairytale would have taken place during 1988 or 1989. Because Bandit was 10 years old in Fairytale, he would have been born some time between 1977 and 1979. Assuming Season 3 takes place in 2022, this would place him somewhere between 43 and 45 years old in Season 3. Bandit is revealed to have a doctorate in archaeology in Archaeology. In Polish dub, his name is Bandżi (pronounced bungee). Seesaw reveals that he weighs about as much as Bluey, Bingo, Chloe, and Coco put together. In Movies, he's revealed to dislike musical movies, as when the character in the movie he and his daughters were watching started singing, he exclaimed, Ugh! Songs!. Family Meeting reveals that he charges his tablet on the bedside table and sometimes drops it. It’s revealed in Pavlova (Episode) that Bandit, and possibly Chilli, in the English Dub, can both speak French. Because Bluey and Bingo don't speak French, Bandit takes advantage of that to speak nonsense French to them, as if teasing them.",
    "absences": "Shadowlands, Calypso, Shops, The Adventure, Early Baby, Mums and Dads, Sticky Gecko, Army, Helicopter, Grandad, Library, Barky Boats, Muffin Cone, Typewriter, Stories, Space, Crazy Christmas Lights, The Lollipop Song, Tea Party with Bluey, Humpty Dumpty, Flying Saucer, Tongue Twister, Green Bottles, Make Mum Laugh, Honk, Highball, K9 News",
    "gallery": "",
    "animated": "",
    "references": ""
  },
  {
    "characterName": "Bella",
    "description1": "Bella is a Poodle with pink and dark pink fur. She has pink legs, feet, arms, hands, tail stem, eyebrows and face, and dark pink arm tufts, leg tufts, tail tuft, torso tuft and head tuft. She also has a black nose.",
    "description2": "Bella is Chilli and Snickers’ Mum's friend. She has nine kids including Coco and a husband.",
    "catchphrase": "",
    "appearance": "Bella is a Poodle with pink and dark pink fur. She has pink legs, feet, arms, hands, tail stem, eyebrows and face, and dark pink arm tufts, leg tufts, tail tuft, torso tuft and head tuft. She also has a black nose.",
    "personality": "",
    "nicknames": "",
    "breed": "Poodle",
    "gender": "Female ♀",
    "age": "",
    "eyes": "Black",
    "fur": "Pink and dark pink",
    "relatives": "Coco (daughter), Unnamed husband, 3 unnamed sons, 5 unnamed daughters",
    "friends": "Chilli, Snickers’ Mum, Wendy",
    "firstAppearance": "Shadowlands",
    "trivia": "In Shadowlands, she is voiced by Hsiao-Ling Tang, who also voices Chloe’s Mum, but in Baby Race, she is voiced by Leigh Sales., Her name was revealed in Baby Race., She has nine kids, including Coco and her siblings.",
    "absences": "",
    "gallery": "",
    "animated": "",
    "references": ""
  },
  {
    "characterName": "Bentley",
    "description1": "Small, inventive and determined.",
    "description2": "Bentley is friends with most of the students in Mrs. Retriever’s school. She has a sister.",
    "catchphrase": "",
    "appearance": "Bentley is a Cavalier King Charles Spaniel[1] with white and brown fur. She has brown legs, arms, tail stem, torso, ears and head, and whiter feet, hands, tail tip, chest and muzzle. She also has a black nose.",
    "personality": "",
    "nicknames": "",
    "breed": "Cavalier King Charles Spaniel",
    "gender": "Female ♀",
    "age": "8",
    "eyes": "Black",
    "fur": "White and brown",
    "relatives": "Zara (twin sister)",
    "friends": "Bingo",
    "firstAppearance": "Bike",
    "trivia": "In the Italian dub, she is male instead of female. She gets sad when she can't do something, just like most people.",
    "absences": "",
    "gallery": "",
    "animated": "",
    "references": "https://www.instagram.com/p/Cc2PNDJrmb6/"
  },
  {
    "characterName": "Bentley’s Mum",
    "description1": "The mother of Bentley and Zara. Seen in Daddy Dropoff.",
    "description2": "",
    "catchphrase": "",
    "appearance": "",
    "personality": "",
    "nicknames": "",
    "breed": "",
    "gender": "",
    "age": "",
    "eyes": "",
    "fur": "",
    "relatives": "",
    "friends": "",
    "firstAppearance": "",
    "trivia": "",
    "absences": "",
    "gallery": "",
    "animated": "",
    "references": ""
  },
  {
    "characterName": "Biscuits & Buttermilk",
    "description1": "Biscuits and Buttermilk are minor characters who appear throughout Bluey.",
    "description2": "",
    "catchphrase": "",
    "appearance": "Biscuits is a miniature pony with white fur, shiny grey hooves with star-shaped friendship bracelets on them, a turquoise colored mane with pearls sticked on to it, and a yimin blue horse noseband wrapped around her muzzle. The inside of her mouth is pink, her eyes are central black irises, and her nose nostrils and the inside of her ears are a shady grey. Buttermilk is a pony with white fur and colorful hair. She has a pink saddle and muzzle. She is also seen with a rainbow-colored horn.",
    "personality": "",
    "nicknames": "",
    "breed": "",
    "gender": "",
    "age": "",
    "eyes": "",
    "fur": "",
    "relatives": "",
    "friends": "",
    "firstAppearance": "",
    "trivia": "",
    "absences": "",
    "gallery": "",
    "animated": "",
    "references": ""
  },
  {
    "characterName": "Bob Heeler",
    "description1": "Bob has no known real friends yet, but he is the husband of Chris (Nana), the dad of Bandit, Stripe, and Rad, the father-in-law of Chilli and Trixie, and the grandpa of Bluey, Bingo, Muffin and Socks.",
    "description2": "Bob is a secondary character who first appeared in Grannies.",
    "catchphrase": "",
    "appearance": "Bob is a Blue Heeler with white, grey, black, dark grey and brown fur. He has white feet, hands, chest, muzzle and eyebrows, grey legs, leg spots, arms, torso, tail tip and head spots, dark grey leg splotches, leg spots, tail stem and right head, black outer ears, and brown leg spots, head spots, left head and inner ears. He also has a black nose, beard whiskers on his muzzle and part of his left ear missing. In his younger years (during the 80s), his grey fur used to be blue and his dark grey and brown (on his head) fur used be black, similar to his son Bandit. His left ear also used to be whole as well.",
    "personality": "",
    "nicknames": "",
    "breed": "Blue Heeler",
    "gender": "Male ♂",
    "age": "",
    "eyes": "Black",
    "fur": "White, grey, dark grey, black and brown",
    "relatives": "Chris (wife), Bandit (son), Stripe (son), Rad (son), Chilli (daughter-in-law), Bluey (granddaughter), Bingo (granddaughter), Trixie (daughter-in-law), Muffin (granddaughter), Socks (granddaughter), Chris's Nana (grandmother in-law)",
    "friends": "",
    "firstAppearance": "Grannies",
    "trivia": "He has a piece of his left ear missing. Bob is voiced (as a retiree) by writer, actor, director, producer, teacher, essayist and painter Ian McFadyen. Bob has had the longest absence of any character, with a gap of 101 episodes between his physical appearances in Grannies and Fairytale, but even his appearance in Fairytales was a flashback. Since the episode called Christmas Swim, many fans have speculated him to be dead, while others think that he was divorced, others think he passed away due to dementia, others think he's too busy focusing on a job or was likely sent to a hospital in a prolonged time for long-term care. No official explanation has been provided yet. In a 2021 interview[1], Joe Brumm confirmed that Bob is alive and would make an appearance in season 3, offering proof of life - so presumably not referring to Fairytale. He offered an out-of-character reason for his absence: Mort was given all the Grandad stories to show some of Chilli's side of the family. Although there are a couple of people that think he just isn't too connected to the family due to a possible conflict. However, it's strange to think that the family aren't somewhat concerned about it nor they explain the loss of it. This is acknowledged in an episode Bedroom, Bingo says “Goodnight Grandpa Bob, wherever you are,” hinting Bob’s absence. In the short Humpty Dumpty, Muffin mentions him as grandad when Chilli decides to send him a message. Although, she doesn't specify which one. She could be referring to Trixie's father but many believe that the message is in fact being sent to Bob. His nick name is Bobba, used by Nana in the Episode Grannies, and in the Grannies book. A younger version of him can be seen in Fairytale Also, despite his more youthful appearance in the said episode, he doesn't even remember his sons' name. He had blue and black fur when he was younger, making him look like Bandit. Bob did make a major appearance in the book Where's Bluey? where he makes a cameo holding a soda can in one page that takes place in the episode BBQ. His small appearance did mean something, in which you have to find items scattered across the scenario full of characters, he was one of them.",
    "absences": "",
    "gallery": "",
    "animated": "",
    "references": ""
  },
  {
    "characterName": "Chilli Heeler",
    "description1": "After having the kids, Chilli’s recently gone back to her job working at Airport Security and juggles this with raising her two little pups. Mum often has a wry comment about the kids' antics or a kind word for an overwrought child, but she’s equally at home throwing herself into a game and always able to see the funny side.",
    "description2": "Chilli is a member of the Heeler family. She's the wife of Bandit, the mother of Bluey and Bingo, the aunt of Muffin and Socks, the daughter-in-law of Bob and Nana, and the sister-in-law of Trixie, Rad, and Stripe. Her father is Mort, and her older sister is Brandy. Chilli works part-time in airport security As a child, Chilli spent a lot of time playing in the scrub near her father’s home[1]. Her family would vacation at a caravan park where Bandit would recall meeting as children; Chilli does not remember this, but admits it could be the case[2]. She recalls their first meeting being a party in London[3]. Chilli would later recall that Bandit had a finger up his nose when they first met[4].The two began dating, and eventually went on a backpacking trip to Italy. While there, Bandit proposed to Chilli, and she accepted. The pair were later married[5]. Among the guests at the wedding were Frisky, who would later become Bluey’s godmother, and Bandit's brother Rad. The venue included a pool, which Rad probably fell into[6]. Some time afterwards, Chilli became pregnant, later giving birth to Bluey[7]. Bingo, their youngest daughter, would be born a couple of years later[8].Chilli currently lives with Bandit and her daughters in the suburbs.",
    "catchphrase": "",
    "appearance": "Chilli is a Red Heeler with cream, light orange and brown fur. She has cream feet, hands, tail spots, back spots, chest, muzzle and eyebrows, light orange legs, arms, tail, torso and head, brown outer ears and right head and light brown inner ears. She also has a dark brown nose.",
    "personality": "Chilli is a character that cares about her family. She's a comforting character as seen on Yoga Ball and Sleepytime. She likes to play along with her daughter and husband whenever they're setting up games.",
    "nicknames": "Pavlova, Lady Gaberdine, Madge, Chilli Dog, Sharon",
    "breed": "Red Heeler",
    "gender": "Female ♀",
    "age": "41-44",
    "eyes": "Black",
    "fur": "Cream, light orange and brown",
    "relatives": "Bandit (husband), Bluey (daughter), Bingo (daughter), Mort (father), Mrs. Cattle (mother), Brandy (older sister), Stripe (brother-in-law), Radley (brother-in-law), Trixie (sister-in-law), Muffin (niece), Socks (niece), Bob (father-in-law), Chris (mother-in-law), Auntie Mary (aunt)",
    "friends": "Daisy, Mackenzie’s Mum, Chloe’s Mum, Snickers’ Mum, Bella, Wendy, Frisky, Maynard, Pat",
    "firstAppearance": "The Magic Xylophone",
    "trivia": "Chilli plays field hockey with her sister-in-law and excels to the point of winning awards. Chilli loves a good problem, as shown and explained in Bingo when she was fixing the toilet. Chilli has the most episode absences out of the immediate Heeler Family. Younger versions of Chilli can be seen in Grandad and Baby Race. If Bandit is correct on how the two first met, a kid version of Chilli can also be seen in Fairytale. If his version is indeed correct, Chilli was a fan of She-Ra as seen by the costume she wore in the aforementioned episode. She is the only member of the show's main family whose first name does not start with a B. She is named after food, just like with Coco, Honey and Snickers. In Sticky Gecko, Queens, Grandad and Perfect; Chilli displays a “very angry face”. This indicates that Chilli is especially annoyed or irritated. In Sticky Gecko, Chilli says, Damn it. Really stuck! This was cut from US releases because it is a swear in the US. In Bin Night, she reveals that when they are little, heelers are a bit stubby, but tough. In Library, Stripe reveals her nickname: Chilli Dog. In the Weekend Pilot, she is at one point drawn without her brown fur patch on her face, despite this, her pilot design did have the brown patch. She was called by the zoo visitor name Lady Gaberdine in Zoo. Chilli is voiced by Australian actress, model, artist, journalist, and performer Melanie Zanetti. She is named after the hot-tasting spicy vegetable of the same name; the Chilli Pepper. Her maiden name may be Cattle, although this depends on whether or not Brandy is married. Brandy's last name was confirmed by Nick Rees on Twitter (@N1ckBee5) who made a poster for the Onesies episode and credited her last name as Cattle”.[9] She seems to enjoy eating sardines, as revealed in Smoochy Kiss. Her job as airport security might be a reference to sniffer dogs, and she might even be one. Chilli is known to frequently hum the show's theme song. Doing so across multiple episodes.",
    "absences": "Hospital, Bike, Takeaway (with the exception of her voice), Butterflies, Calypso, Shops, The Creek, The Dump, The Adventure, Early Baby, Mums and Dads, Kids, Squash, Charades, Army, Movies, Barky Boats, Octopus, Ice Cream, Typewriter, Explorers, Ragdoll (mentioned only), Stories, Turtleboy (mentioned only), Space, Silent Night (before Christmas), Crazy Christmas Lights, Jingle Bells, Tea Party with Bluey, Pea Pod Sausages, Tongue Twister, Honk, Highball, K9 News",
    "gallery": "",
    "animated": "",
    "references": ""
  },
  {
    "characterName": "Muffin",
    "description1": "Bluey’s non-stop cousin. Always speaks her mind.",
    "description2": "",
    "catchphrase": "",
    "appearance": "",
    "personality": "",
    "nicknames": "",
    "breed": "",
    "gender": "",
    "age": "",
    "eyes": "",
    "fur": "",
    "relatives": "",
    "friends": "",
    "firstAppearance": "",
    "trivia": "",
    "absences": "",
    "gallery": "",
    "animated": "",
    "references": ""
  },
  {
    "characterName": "Jack",
    "description1": "Jack is a new student at Calypso’s School, best friends with Rusty, the son of his parents and the older brother of Lulu.",
    "description2": "Jack Russell is a lively Jack Russell terrier. His best friend is Rusty.",
    "catchphrase": "",
    "appearance": "Jack is a Jack Russell Terrier with brown, light brown, dark brown and white fur. He has white feet, legs, hands, arms, tail tip, tummy, head and muzzle, brown ears and inner torso spot, dark brown tail stem, outer torso spot and eyebrows, and brown head spots. He also has a grey nose.",
    "personality": "",
    "nicknames": "",
    "breed": "Jack Russell Terrier",
    "gender": "Male ♂",
    "age": "6, 7",
    "eyes": "Black",
    "fur": "Brown, light brown, dark brown and white",
    "relatives": "Jack's Dad, Jack's Mum, Lulu (younger sister)",
    "friends": "Rusty (best friend), Bluey, Coco, Mackenzie",
    "firstAppearance": "Army",
    "trivia": "He loves condensed milk. He is the first known character to be neurodivergent, in his case he has ADHD. In Explorers, it is revealed that Jack and his family are from Victoria. This can be shown on the number plate shown on his family's car.",
    "absences": "",
    "gallery": "",
    "animated": "",
    "references": ""
  },
  {
    "characterName": "Rusty",
    "description1": "Bluey’s friend from the bush. Already rides a motorbike.",
    "description2": "",
    "catchphrase": "",
    "appearance": "",
    "personality": "",
    "nicknames": "",
    "breed": "",
    "gender": "",
    "age": "",
    "eyes": "",
    "fur": "",
    "relatives": "",
    "friends": "",
    "firstAppearance": "",
    "trivia": "",
    "absences": "",
    "gallery": "",
    "animated": "",
    "references": ""
  },
  {
    "characterName": "Lucky",
    "description1": "Adventurous next door neighbour. Can’t stop moving.",
    "description2": "",
    "catchphrase": "",
    "appearance": "",
    "personality": "",
    "nicknames": "",
    "breed": "",
    "gender": "",
    "age": "",
    "eyes": "",
    "fur": "",
    "relatives": "",
    "friends": "",
    "firstAppearance": "",
    "trivia": "",
    "absences": "",
    "gallery": "",
    "animated": "",
    "references": ""
  },
  {
    "characterName": "Mackenzie Border Collie",
    "description1": "Quick, sociable and from New Zealand.",
    "description2": "",
    "catchphrase": "",
    "appearance": "Mackenzie is a Border Collie with white and black fur. He has a black left foot, a black right leg, black arms, torso, tail, head and ears, and a white right foot, a white left leg, white hands, muzzle, face and inner ears. He also has a black nose.",
    "personality": "Mackenzie is an enthusiastic and friendly character in general. He is impatient, as shown in the episode Shops, and prefers to get to the point. He can be a bit rude and upset at times but he is easy to cheer up as seen in Barky Boats.",
    "nicknames": "",
    "breed": "Border Collie",
    "gender": "Male ♂",
    "age": "",
    "eyes": "Black",
    "fur": "Black and White",
    "relatives": "Mackenzie’s Dad, Mackenzie’s Mum",
    "friends": "Bluey, Captain, Honey, Coco, Chloe, Bingo, Bandit, Rusty, Hercules, Jack",
    "firstAppearance": "Fruitbat (cameo)",
    "trivia": "Mackenzie's appearance was inspired by Dog from the New Zealand comic Footrot Flats.[1] He is one of very few kids that have a known voice actor along with Chloe, Judo, and Snickers. He is from New Zealand. He can be seen in the pilot episode in the theme song, but with a different design, as his left leg and foot are the same as his right leg and foot, instead of having a white left leg and black left foot. Mackenzie with Bluey appear to show some friendly rivalry. Mackenzie and Bluey do have disagreements when playing games, as prominent in Shops. In Barky Boats, both Mackenzie and Bluey blew raspberries at each other. He calls Bandit Bluey's Dad (The Creek). He is 6 years old as revealed in Barky Boats. Like Bluey and Bingo, many fans at first thought that he was the opposite gender because of the name Mackenzie usually being a girl name. This has even led to some international dubs of the show incorrectly portraying Mackenzie as a girl. In the first season of the Latin American dub, he is incorrectly portrayed as female, this is fixed in the following of said dub. MacKenzie's family name was revealed in Curry Quest. In Space, it's revealed that Mackenzie used to have an abandonment issue stemming from a time when he was little where he found himself separated from his mother. At the end of the episode, he is able to find closure and move on. In Polish dub, his name is Kołnierzyk which means Collar. In Curry Quest, when Bandit is saying goodbye to Mackenzie and his parents, he refers to them as the Border Collies or perhaps a variation such as Border-Collies. This would imply that that is their family surname.",
    "absences": "",
    "gallery": "",
    "animated": "",
    "references": ""
  },
  {
    "characterName": "Indy",
    "description1": "Super open and imaginative.",
    "description2": "Indy is friends with most of the students in Calypso’s school. She has a Mum and a sister, but no known dad as of yet.",
    "catchphrase": "",
    "appearance": "Indy is an Afghan Hound with tan, orange, and cream fur. She has tan on her legs, hands, arms, tail, torso, bottom of her head and muzzle, and eyebrows; orange on her hair and the top of her head and muzzle; and cream feet. She also has a black nose and wears green hair rings, a brown, pink, blue, green, and yellow vest with a rainbow at the back, and a necklace with a white swirly circle on it.",
    "personality": "",
    "nicknames": "",
    "breed": "Afghan Hound",
    "gender": "Female ♀",
    "age": "",
    "eyes": "Black",
    "fur": "Orange, tan and cream",
    "relatives": "Indy's Mum, Unnamed sister (Early Baby)",
    "friends": "Bluey, Bingo, Chloe, Honey, Rusty, Gruber, Winton, Snickers, The Terriers, Coco, Mackenzie",
    "firstAppearance": "Calypso",
    "trivia": "She is not allowed to eat wheat/gluten, sugar, salt, dairy, or food with added ingredients (like prepackaged tomato sauce, barbecue sauce and mustard), whether it be due to her allergies, her religion, her tradition or her family's basic diet. She is seen with longer hair in some episodes, but the studio shortened her hair to make it easier to animate. When she had longer hair, she could be seen with green, blue, yellow, and pink hair rings. The Early Baby episode reveals that Indy has a sister that either had a premature baby or was a preemie baby herself. (At the moment, this hasn't been elaborated on.) it can be assumed, though based on what Bluey says that it was her sister that had the premature or early baby since she says, Indy wanted to play Early Baby like her sister in real life. Another character that mentioned her sibling and still didn't appear in the series, is Winnie. Her name is a diminutive of Indianapolis.",
    "absences": "",
    "gallery": "",
    "animated": "",
    "references": ""
  },
  {
    "characterName": "Honey",
    "description1": "Assertive, thoughtful and mindful.",
    "description2": "Honey is friends with many of the children in Calypso‘s school. She has a Dad called Marcus and a Mum called Daisy.",
    "catchphrase": "",
    "appearance": "Honey is a Beagle with white, honey, dark honey and brown fur. She has white feet, hands, 1st tail tip, chest and muzzle, honey legs, arms, tail stem, torso and head, brown eyebrows and 2nd tail tip and dark honey ears. She also has a black nose and wears circle turquoise glasses.",
    "personality": "",
    "nicknames": "",
    "breed": "Beagle",
    "gender": "Female ♀",
    "age": "",
    "eyes": "Black",
    "fur": "White, honey, dark honey and brown",
    "relatives": "Daisy (Mum), Marcus (Dad)",
    "friends": "Bluey, Coco, Chloe, Mackenzie, Indy, Bingo, Rusty, Hercules, Snickers, The Terriers",
    "firstAppearance": "Spy Game",
    "trivia": "Honey’s parents both wear glasses like her. Her tail can wag her body, unlike other dogs, whose bodies wag their tails. Her name is a reference to the sweet food substance of the same name, Honey.",
    "absences": "",
    "gallery": "",
    "animated": "",
    "references": ""
  },
  {
    "characterName": "Coco",
    "description1": "Enthusiastic, impatient.",
    "description2": "Coco is friends with most of the students in Calypso’s School. She has a mum, a dad and eight older siblings.",
    "catchphrase": "",
    "appearance": "Coco is a pink Poodle that wears blue butterfly hair clips. She has bright pink tufts of fur on her head, ears, hands, feet and tail. The rest is light pink.",
    "personality": "",
    "nicknames": "",
    "breed": "Poodle",
    "gender": "Female ♀",
    "age": "7 and a half",
    "eyes": "Black",
    "fur": "Pink and light pink",
    "relatives": "Bella (mother), Unnamed father, 3 unnamed older brothers, 5 unnamed older sisters",
    "friends": "Bluey, Bingo, Indy, Rusty, Honey, Snickers, Chloe, The Terriers, Hercules, Pom Pom, Jack",
    "firstAppearance": "Shadowlands",
    "trivia": "She likes to sometimes bend the rules of certain games to make it easier for her. She is the only kid and one of five characters to have visible eyelashes, the others being Calypso, Mrs. Retriever, Wendy, and Cherry. In the episode Baby Race, it is revealed that she has eight siblings, all of which are older than her. A baby version of her can be seen in the episode Baby Race. She is the first female out of Bluey's friends to appear. She appears to have a crush on Mackenzie, as seen in Circus. In Brazilian version, her name is Cacau which means Cocoa.",
    "absences": "",
    "gallery": "",
    "animated": "",
    "references": ""
  },
  {
    "characterName": "Customer",
    "description1": "Customer is a secondary character who appeared in Kids.",
    "description2": "Customer is friends with Bandit, but has no relatives as of yet.",
    "catchphrase": "",
    "appearance": "Customer is a Siberian Husky. He has brown legs, arms, tail stem and torso, dark brown outer ears and head, white feet, tail tip, chest, hands, eyebrows and outer muzzle, grey muzzle and pink inner ears. He also has a black nose.",
    "personality": "",
    "nicknames": "",
    "breed": "Siberian Husky",
    "gender": "Male ♂",
    "age": "",
    "eyes": "Grey and black",
    "fur": "Brown, dark brown, white, grey and pink",
    "relatives": "",
    "friends": "Bandit",
    "firstAppearance": "Kids",
    "trivia": "He has the same design as Poffertje Dog who appeared in Markets, but he is voiced by a different person in each occurrence. He is one of the few characters to have a coloured iris. He is voiced by director Joe Brumm",
    "absences": "",
    "gallery": "",
    "animated": "",
    "references": ""
  },
  {
    "characterName": "Customer 2",
    "description1": "Customer 2 is a secondary character that has appeared in multiple episodes of Bluey.",
    "description2": "Customer 2 sells fruit and veggies at the market and has no known friends or relatives as of yet.",
    "catchphrase": "",
    "appearance": "Customer 2 is a Basenji with orange, white, pink and light brown fur. It has orange legs, arms, tail stem, torso, head and outer ears, white feet, tail tip, hands, chest and eyebrows, light brown muzzle and pink inner ears. It also has a black nose.",
    "personality": "",
    "nicknames": "",
    "breed": "Basenji",
    "gender": "",
    "age": "",
    "eyes": "Black",
    "fur": "Orange, White and Light Brown",
    "relatives": "",
    "friends": "",
    "firstAppearance": "Markets",
    "trivia": "The gender for customer 2 is currently unknown.",
    "absences": "",
    "gallery": "",
    "animated": "",
    "references": ""
  },
  {
    "characterName": "Snickers",
    "description1": "Not the most physical kid but loves machines, atoms and the stars.",
    "description2": "",
    "catchphrase": "",
    "appearance": "",
    "personality": "",
    "nicknames": "",
    "breed": "",
    "gender": "",
    "age": "",
    "eyes": "",
    "fur": "",
    "relatives": "",
    "friends": "",
    "firstAppearance": "",
    "trivia": "",
    "absences": "",
    "gallery": "",
    "animated": "",
    "references": ""
  },
  {
    "characterName": "Chloe",
    "description1": "Bluey’s Best Friend. Super kind, gentle and smart.",
    "description2": "Chloe is Bluey’s best friend but is also friends with most of the students in Calypso‘s school. She is seven years old, and has a Dad, Mum and Baby Brother.",
    "catchphrase": "",
    "appearance": "Chloe is a Dalmatian with white and black fur. She has black leg spots, arm spots, chest spots, tail tip, ear spots and head spots, and white feet, legs, arms, hands, tail stem, torso, head, ears and eyebrows. She also has a black nose and bright pink inner ears.",
    "personality": "Chloe is energetic and loves playing with Bluey and her friends at Calypso's School.",
    "nicknames": "",
    "breed": "Dalmatian",
    "gender": "Female ♀",
    "age": "6, 7 (as of Featherwand)",
    "eyes": "Black",
    "fur": "White with black spots",
    "relatives": "Frank (father), Chloe’s Mum, Unnamed baby brother",
    "friends": "Bluey (best friend), Bingo, Mackenzie, Indy, Honey, Rusty, Coco, Gruber",
    "firstAppearance": "Bike",
    "trivia": "Her age was revealed to be 7 at the start of Featherwand . In the episode Featherwand an invitation to her birthday party read by Chilli has an address of 26 Nudgee Road. In the episode Octopus her house has a number 101 on it; this may indicate that the party was held somewhere other than her house Chloe’s house, as shown in episode Octopus, have a number 101 which is a reference to a 1956 book The Hundred and One Dalmatians by Dodie Smith and its 1961 animated film adaptation One Hundred and One Dalmatians, both focusing on family of 101 Dalmatian dogs. It might also refer to 2019 animated TV show 101 Dalmatian Street which aired on Disney Channel, Disney Junior and Disney+ same as Bluey. She is the first character who had a birthday and aged up in the series. Her favourite TV show is the same as Bluey's, Chunky Chimp. In Polish version, her name is Łatka which means Spot. It's revealed in Dunny that her family bans her from using the word naughty.",
    "absences": "",
    "gallery": "",
    "animated": "",
    "references": ""
  },
  {
    "characterName": "Chloe's Mum",
    "description1": "Chloe’s Mum is friends with Bluey, Honey and Mackenzie’s parents. she has a daughter named Chloe, a husband and a baby son.",
    "description2": "",
    "catchphrase": "",
    "appearance": "Chloe’s Mum is a Dalmatian with white and black fur. She has black leg spots, torso spots, arm spots, tail tip, head spots and ears, and white feet, legs, arms, hands, torso, tail stem, head, eyebrows and ear spots. She also has a black nose and is commonly seen wheeling a pram around with Chloe’s Baby Brother inside of it.",
    "personality": "",
    "nicknames": "",
    "breed": "Dalmatian",
    "gender": "Female ♀",
    "age": "",
    "eyes": "Black",
    "fur": "White and black fur and spots",
    "relatives": "Frank (husband), Chloe (daughter), Unnamed son",
    "friends": "Bandit, Chilli, Mackenzie’s Dad, Mackenzie’s Mum, Marcus, Daisy",
    "firstAppearance": "The Magic Xylophone",
    "trivia": "Chloe's Mum is voiced by actress Hsiao-Ling Tang. She is mostly seen taking her baby for a walk. She is the first secondary character, who is not part of the Bluey family to cameo in Bluey.",
    "absences": "",
    "gallery": "",
    "animated": "",
    "references": ""
  },
  {
    "characterName": "Frank",
    "description1": "Frank[1] is a secondary character that has appeared in multiple episodes of Bluey.",
    "description2": "Frank is friends with Bluey, Mackenzie and Honey‘s parents. He has a wife, a baby son and a daughter named Chloe.",
    "catchphrase": "",
    "appearance": "Frank is a Dalmatian with white and black fur. He has black leg spots, arm spots, torso spots, tail spots, tail tip, head spots, eyebrows and ears, and white feet, legs, hands, arms, tail stem, torso and head. He also has a black nose.",
    "personality": "",
    "nicknames": "",
    "breed": "Dalmatian",
    "gender": "Male ♂",
    "age": "",
    "eyes": "Black",
    "fur": "White and black fur and spots",
    "relatives": "Chloe (daughter), Chloe’s Mum (wife), Unnamed son",
    "friends": "Chilli, Bandit, Mackenzie’s Dad, Mackenzie’s Mum, Marcus, Daisy",
    "firstAppearance": "Spy Game",
    "trivia": "He is voiced by one of the show’s designers, Francis Stanton.",
    "absences": "",
    "gallery": "",
    "animated": "",
    "references": ""
  },
  {
    "characterName": "Chloe's Mum",
    "description1": "Chloe’s Mum is friends with Bluey, Honey and Mackenzie’s parents. she has a daughter named Chloe, a husband and a baby son.",
    "description2": "",
    "catchphrase": "",
    "appearance": "Chloe’s Mum is a Dalmatian with white and black fur. She has black leg spots, torso spots, arm spots, tail tip, head spots and ears, and white feet, legs, arms, hands, torso, tail stem, head, eyebrows and ear spots. She also has a black nose and is commonly seen wheeling a pram around with Chloe’s Baby Brother inside of it.",
    "personality": "",
    "nicknames": "",
    "breed": "Dalmatian",
    "gender": "Female ♀",
    "age": "",
    "eyes": "Black",
    "fur": "White and black fur and spots",
    "relatives": "Frank (husband), Chloe (daughter), Unnamed son",
    "friends": "Bandit, Chilli, Mackenzie’s Dad, Mackenzie’s Mum, Marcus, Daisy",
    "firstAppearance": "The Magic Xylophone",
    "trivia": "Chloe's Mum is voiced by actress Hsiao-Ling Tang. She is mostly seen taking her baby for a walk. She is the first secondary character, who is not part of the Bluey family to cameo in Bluey.",
    "absences": "",
    "gallery": "",
    "animated": "",
    "references": ""
  },
  {
    "characterName": "Judo",
    "description1": "Bluey’s other neighbour.",
    "description2": "",
    "catchphrase": "",
    "appearance": "",
    "personality": "",
    "nicknames": "",
    "breed": "",
    "gender": "",
    "age": "",
    "eyes": "",
    "fur": "",
    "relatives": "",
    "friends": "",
    "firstAppearance": "",
    "trivia": "",
    "absences": "",
    "gallery": "",
    "animated": "",
    "references": ""
  },
  {
    "characterName": "Jean Luc",
    "description1": "Bluey’s French Canadian camping buddy.",
    "description2": "Jean-Luc is a secondary character that appeared in Camping.",
    "catchphrase": "",
    "appearance": "Jean-Luc is a Labrador with Bluish-black fur covering his full body. He also has a dark blue nose.",
    "personality": "",
    "nicknames": "",
    "breed": "Labrador",
    "gender": "Male ♂",
    "age": "6, 19 (future)",
    "eyes": "Black",
    "fur": "Bluish-black Navy",
    "relatives": "Jean-Luc's Dad, Jean-Luc's Mum",
    "friends": "Bluey, Bandit",
    "firstAppearance": "Camping",
    "trivia": "Jean-Luc and his parents speak French. He is French-Canadian in reference to how his breed – the Labrador Retriever – is named after the province of Newfoundland and Labrador. As the name suggests, the province is comprised of the island of Newfoundland and the mainland region of Labrador, which is located in the northeast of Canada and borders the predominantly French-speaking province of Québec. The province also lends its name to another breed of dog: the Newfoundland or Newfie. Jean-Luc is similar in appearance to Lucky, but isn’t slimmer towards his waist like Lucky and has different coloured fur. His future self speaks English as seen at the end of Camping. A drawing of him and Bluey can be seen in Bingo and The Show. In the French dub, Jean Luc is renamed Johnny, and he speaks English. This is the reverse of how it is in the original English version. He only appears in one episode. His name is pronounced John-Luke.",
    "absences": "",
    "gallery": "",
    "animated": "",
    "references": ""
  },
  {
    "characterName": "The Terriers",
    "description1": "Unstoppable forces of nature. They’re little terriers.",
    "description2": "",
    "catchphrase": "",
    "appearance": "",
    "personality": "",
    "nicknames": "",
    "breed": "",
    "gender": "",
    "age": "",
    "eyes": "",
    "fur": "",
    "relatives": "",
    "friends": "",
    "firstAppearance": "",
    "trivia": "",
    "absences": "",
    "gallery": "",
    "animated": "",
    "references": ""
  },
  {
    "characterName": "Socks",
    "description1": "Muffin’s baby sister is just starting to talk.",
    "description2": "",
    "catchphrase": "",
    "appearance": "",
    "personality": "",
    "nicknames": "",
    "breed": "",
    "gender": "",
    "age": "",
    "eyes": "",
    "fur": "",
    "relatives": "",
    "friends": "",
    "firstAppearance": "",
    "trivia": "",
    "absences": "",
    "gallery": "",
    "animated": "",
    "references": ""
  },
  {
    "characterName": "Missy",
    "description1": "Super brave when she’s ready.",
    "description2": "Missy is a secondary character that has appeared in multiple episodes of Bluey.",
    "catchphrase": "",
    "appearance": "Missy is an Aussie Terrier[1] with black, brown, dark brown and light brown fur. She has black legs, arms, torso and tail top, brown feet, hands, chest, head, ears and bottom tail, light brown eyebrows and a dark brown muzzle. She also has a black nose, and wears dark blue, pink and turquoise beads around her ears.",
    "personality": "",
    "nicknames": "",
    "breed": "Aussie Terrier",
    "gender": "Female ♀",
    "age": "5 (as of Pass the Parcel)",
    "eyes": "Black",
    "fur": "Black, brown, dark brown and light brown.",
    "relatives": "Unnamed mother",
    "friends": "Bluey, Bingo",
    "firstAppearance": "Bob Bilby",
    "trivia": "She is normally quite shy but can be super brave if she’s ready. Her birthday is the 18th of an unknown month. In Pass the Parcel, it reveals she has a mother, but she has no known dad yet. Despite common misconception, it's confirmed she's based off a Season 1 Production Lead's Aussie Terrier.",
    "absences": "",
    "gallery": "",
    "animated": "",
    "references": ""
  },
  {
    "characterName": "Buddy",
    "description1": "Patient for days.",
    "description2": "Buddy is a secondary character that has appeared in multiple episodes of Bluey.",
    "catchphrase": "",
    "appearance": "Buddy is a Fawn Pug with brown, light brown and tan fur. He has tan legs, feet, arms, hands, tail, torso and head, brown eyebrows and ears, and light brown muzzle. He also has a brown nose.",
    "personality": "",
    "nicknames": "",
    "breed": "Pug",
    "gender": "Male ♂",
    "age": "5 (as of Pass the Parcel)",
    "eyes": "Black",
    "fur": "Brown, light brown and tan",
    "relatives": "Unnamed mother",
    "friends": "Bingo, Media",
    "firstAppearance": "Bob Bilby",
    "trivia": "He is usually seen panting and picking his nose He is 5 and his birthday is on November 12th, as confirmed in Pass the Parcel November 12th, 2020 is also the air date of Handstand.",
    "absences": "",
    "gallery": "",
    "animated": "",
    "references": ""
  },
  {
    "characterName": "Buddy's Mum",
    "description1": "Muffin’s baby sister is just starting to talk.",
    "description2": "Buddy's mum is friends with the parents of Buddy's friends. Aside from her son, she has no known family members.",
    "catchphrase": "",
    "appearance": "Buddy's mum is a pug with tan fur. Her ears and eyebrows are brown, and her muzzle is grey. She wears lime green half moon glasses.",
    "personality": "",
    "nicknames": "",
    "breed": "Pug",
    "gender": "Female",
    "age": "",
    "eyes": "Black",
    "fur": "Tan, Brown, and Grey",
    "relatives": "Buddy (son), Friend(s), Chilli, Bandit, Pat, Janelle, Missy's Mum, Sheila, Pom Pom's Mom, Jasper's Mum",
    "friends": "",
    "firstAppearance": "Pass the Parcel",
    "trivia": "",
    "absences": "",
    "gallery": "",
    "animated": "",
    "references": ""
  },
  {
    "characterName": "Bull Terriers",
    "description1": "Muffin’s baby sister is just starting to talk.",
    "description2": "Both of the Bull Terriers seem to enjoy being sociable. With most of their cameos being with family members. However, it is unknown if the kid has a father or if the mom has a husband. They have no known friends or family relatives yet.",
    "catchphrase": "",
    "appearance": "Mum: She is a fully-grown Bull Terrier with white fur, but her muzzle, feet, ears and her belly being a light pink yogurty color. She sports a right sided tawny colored eyepatch, her nose being a dusty brown color, and she has slightly plump eyebrows. Kid: He is a young Bull Terrier pup with white fur, but his muzzle, nose, and only the inside of his left ear being a light pink cotton candy color. He sports a right sided fable colored eyepatch, his nose being a blacker color, and he has more oval-like eyebrows. He notably also has floppy ears, a cinnamon-colored spot on his back, and the inside of his right ear is rather a smokey grey instead of pink.",
    "personality": "",
    "nicknames": "",
    "breed": "Bull Terriers",
    "gender": "Female ♀️",
    "age": "",
    "eyes": "Black",
    "fur": "White, brown, grey, maroon, and a bit of pink",
    "relatives": "",
    "friends": "Surfer",
    "firstAppearance": "Piggyback",
    "trivia": "The mum has a eye patch on her right eye, whereas her pup has one on his left eye. They can be seen at a table near the semi-beginning of the aforementioned episode chatting next with some type of orange and white like Brittany. The pup can be viewed playing with a blue toy car, and the mum is sitting right next to him staring at him for safety, and a punnet of strawberries is seen lying next to her. The Bull Terrier mum is the only character with visible flat eyelashes. In The Quiet Game, she is seen chatting with the Surfer without her son in the scene when Bandit, Bluey, and Bingo go out to the streets to pick a present for Muffin.",
    "absences": "",
    "gallery": "",
    "animated": "",
    "references": ""
  },
  {
    "characterName": "Bus Stop Dog",
    "description1": "The Bus Stop Dog is a character who is always sitting on the bench at the bus stop. She has white fur and blue glasses. She speaks once when confronted by Bandit saying she doesn’t need to worry about the Sun since it’s meant to be there. She appears in Wagon Ride and Born Yesterday",
    "description2": "",
    "catchphrase": "",
    "appearance": "",
    "personality": "",
    "nicknames": "",
    "breed": "Samoyed",
    "gender": "Female",
    "age": "",
    "eyes": "Black",
    "fur": "White",
    "relatives": "",
    "friends": "",
    "firstAppearance": "Wagon Ride",
    "trivia": "",
    "absences": "",
    "gallery": "",
    "animated": "",
    "references": ""
  },
  {
    "characterName": "Calypso",
    "description1": "Calypso is the teacher at Bluey's school, Glasshouse Primary School. She has no known relatives but is friends with many of her students.",
    "description2": "Bluey's teacher for Prep. An Aussie Shepherd.",
    "catchphrase": "",
    "appearance": "Calypso is a Blue Merle Australian Shepherd with dark brown, grey, white, dark grey, orange and light orange fur. She has white feet, hands, tail tip, chest, muzzle and head spots, light orange bottom legs, bottom arms, tail bottom, torso, outer muzzle and eyebrows, orange top legs, top arms and outer muzzle, dark brown back spots, head splotches, head spots and top ears, grey tail top and head, and dark grey tail spots. She also has a black nose and wears a blue shawl.",
    "personality": "",
    "nicknames": "",
    "breed": "Australian Shepherd",
    "gender": "Female ♀",
    "age": "",
    "eyes": "Black",
    "fur": "Orange, gray with black spots, and white (merle tricolor)",
    "relatives": "",
    "friends": "",
    "firstAppearance": "Calypso",
    "trivia": "Sister Rain has left, and Father Sun is home. Brother Wind comes blowing in to welcome home the gnome. ― Calypso's song[source] She is voiced by musician and songwriter Megan Alexanda Washington. She works in a Steiner school, Glasshouse Primary, which is based on one in The Samford Valley, near Brisbane. This is the second character to be voiced by a musician, the first being Bandit. Based on her appearance and voice, she appears to be an older character, possibly middle-aged. Her name is based off the genre of Caribbean music of the same name, which features syncopated African rhythms and, typically, words improvised on a topical theme. She is skilled at knitting, as showing off her talent mainly in Barky Boats and Typewriter. There is an episode named after her. Her hair in Calypso is off to the right but it is switched to the left for the rest of Season 1. In Polish dub her name is Pani Matylda (Mrs. Matilda). In the persian dub, Calypso, alongside Pony Lady, is voiced by a man.[citation needed]",
    "absences": "",
    "gallery": "",
    "animated": "",
    "references": ""
  },
  {
    "characterName": "Winton",
    "description1": "A very obedient breed.",
    "description2": "",
    "catchphrase": "",
    "appearance": "",
    "personality": "",
    "nicknames": "",
    "breed": "",
    "gender": "",
    "age": "",
    "eyes": "Black",
    "fur": "",
    "relatives": "",
    "friends": "",
    "firstAppearance": "",
    "trivia": "",
    "absences": "",
    "gallery": "",
    "animated": "",
    "references": ""
  },
  {
    "characterName": "Uncle Stripe",
    "description1": "Dad’s Younger brother & Bluey & Bingo’s Uncle.",
    "description2": "",
    "catchphrase": "",
    "appearance": "",
    "personality": "",
    "nicknames": "",
    "breed": "",
    "gender": "",
    "age": "",
    "eyes": "Black",
    "fur": "",
    "relatives": "",
    "friends": "",
    "firstAppearance": "",
    "trivia": "",
    "absences": "",
    "gallery": "",
    "animated": "",
    "references": ""
  },
  {
    "characterName": "Aunt Trixie",
    "description1": "Bluey & Bingo’s Aunt and Chilli’s hockey teammate.",
    "description2": "",
    "catchphrase": "",
    "appearance": "",
    "personality": "",
    "nicknames": "",
    "breed": "",
    "gender": "",
    "age": "",
    "eyes": "Black",
    "fur": "",
    "relatives": "",
    "friends": "",
    "firstAppearance": "",
    "trivia": "",
    "absences": "",
    "gallery": "",
    "animated": "",
    "references": ""
  },
  {
    "characterName": "Bently",
    "description1": "Small, inventive and determined.",
    "description2": "",
    "catchphrase": "",
    "appearance": "",
    "personality": "",
    "nicknames": "",
    "breed": "",
    "gender": "",
    "age": "",
    "eyes": "Black",
    "fur": "",
    "relatives": "",
    "friends": "",
    "firstAppearance": "",
    "trivia": "",
    "absences": "",
    "gallery": "",
    "animated": "",
    "references": ""
  },
  {
    "characterName": "Nana",
    "description1": "Bandit’s Mum and Bluey & Bingo’s Nana. Retired to the Gold Coast.",
    "description2": "",
    "catchphrase": "",
    "appearance": "",
    "personality": "",
    "nicknames": "",
    "breed": "",
    "gender": "",
    "age": "",
    "eyes": "Black",
    "fur": "",
    "relatives": "",
    "friends": "",
    "firstAppearance": "",
    "trivia": "",
    "absences": "",
    "gallery": "",
    "animated": "",
    "references": ""
  },
  {
    "characterName": "Bob Heeler",
    "description1": "Bluey & Bingo’s Grandad.",
    "description2": "Bob has no known real friends yet, but he is the husband of Chris (Nana), the dad of Bandit, Stripe, and Rad, the father-in-law of Chilli and Trixie, and the grandpa of Bluey, Bingo, Muffin and Socks.",
    "catchphrase": "",
    "appearance": "Bob is a Blue Heeler with white, grey, black, dark grey and brown fur. He has white feet, hands, chest, muzzle and eyebrows, grey legs, leg spots, arms, torso, tail tip and head spots, dark grey leg splotches, leg spots, tail stem and right head, black outer ears, and brown leg spots, head spots, left head and inner ears. He also has a black nose, beard whiskers on his muzzle and part of his left ear missing. In his younger years (during the 80s), his grey fur used to be blue and his dark grey and brown (on his head) fur used be black, similar to his son Bandit. His left ear also used to be whole as well.",
    "personality": "",
    "nicknames": "",
    "breed": "Blue Heeler",
    "gender": "Male ♂",
    "age": "",
    "eyes": "Black",
    "fur": "White, grey, dark grey, black and brown",
    "relatives": "Chris (wife), Bandit (son), Stripe (son), Rad (son), Chilli (daughter-in-law), Bluey (granddaughter), Bingo (granddaughter), Trixie (daughter-in-law), Muffin (granddaughter), Socks (granddaughter), Chris's Nana (grandmother in-law)",
    "friends": "",
    "firstAppearance": "Grannies",
    "trivia": "He has a piece of his left ear missing. Bob is voiced (as a retiree) by writer, actor, director, producer, teacher, essayist and painter Ian McFadyen. Bob has had the longest absence of any character, with a gap of 101 episodes between his physical appearances in Grannies and Fairytale, but even his appearance in Fairytales was a flashback. Since the episode called Christmas Swim, many fans have speculated him to be dead, while others think that he was divorced, others think he passed away due to dementia, others think he's too busy focusing on a job or was likely sent to a hospital in a prolonged time for long-term care. No official explanation has been provided yet. In a 2021 interview[1], Joe Brumm confirmed that Bob is alive and would make an appearance in season 3, offering proof of life - so presumably not referring to Fairytale. He offered an out-of-character reason for his absence: Mort was given all the Grandad stories to show some of Chilli's side of the family. Although there are a couple of people that think he just isn't too connected to the family due to a possible conflict. However, it's strange to think that the family aren't somewhat concerned about it nor they explain the loss of it. This is acknowledged in an episode Bedroom, Bingo says “Goodnight Grandpa Bob, wherever you are,” hinting Bob’s absence. In the short Humpty Dumpty, Muffin mentions him as grandad when Chilli decides to send him a message. Although, she doesn't specify which one. She could be referring to Trixie's father but many believe that the message is in fact being sent to Bob. His nick name is Bobba, used by Nana in the Episode Grannies, and in the Grannies book. A younger version of him can be seen in Fairytale Also, despite his more youthful appearance in the said episode, he doesn't even remember his sons' name. He had blue and black fur when he was younger, making him look like Bandit. Bob did make a major appearance in the book Where's Bluey? where he makes a cameo holding a soda can in one page that takes place in the episode BBQ. His small appearance did mean something, in which you have to find items scattered across the scenario full of characters, he was one of them.",
    "absences": "",
    "gallery": "",
    "animated": "",
    "references": ""
  },
  {
    "characterName": "Bosco",
    "description1": "Bosco is a character mentioned in Bluey. So far, he has never made an appearance; only mentioned. Frisky was his wife or girlfriend, later he broke up with her before the events of Double Babysitter. It's never explained why they broke up, though given that Frisky, when acting as a princess for the Heeler sisters, said that Rad (who was playing the prince) would probably go looking for other princesses, this could imply that either Bosco cheated on Frisky, or Bosco dumped Frisky so that he could date another dog.",
    "description2": "",
    "catchphrase": "",
    "appearance": "",
    "personality": "",
    "nicknames": "",
    "breed": "",
    "gender": "",
    "age": "",
    "eyes": "Black",
    "fur": "",
    "relatives": "",
    "friends": "",
    "firstAppearance": "",
    "trivia": "",
    "absences": "",
    "gallery": "",
    "animated": "",
    "references": ""
  },
  {
    "characterName": "Brandy Cattle",
    "description1": "Brandy Cattle (also known as Aunty Brandy by Bluey and Bingo) is a secondary character, the older sister of Chilli, the sister-in-law of Bandit, and the maternal aunt of Bluey and Bingo.",
    "description2": "Brandy is Chilli's older sister. She distanced herself due to the grief of her sister being able to grow a family while she herself had fertility issues. They hadn't spoken for years, but Chilli eventually found the courage to call her, which lead to them reuniting in Onesies.",
    "catchphrase": "",
    "appearance": "Brandy is a Red Heeler with light orange, dark orange, light cream fur, and a brown nose. She has light cream hands, right foot, left outer ear, left leg, eyebrows, muzzle, forehead, tail spots, belly, a strip in her shoulders and tail end, light orange body, right leg, left foot, start of the tail and inner ears, and dark orange right outer ear, both sides of the head, back spot and tail spot.",
    "personality": "",
    "nicknames": "",
    "breed": "Red Heeler",
    "gender": "Female ♀",
    "age": "Unknown-late 30s to mid 40s",
    "eyes": "Black",
    "fur": "Dark orange, light orange and light cream",
    "relatives": "Mort Cattle (father), Mrs. Cattle (mother), Chilli (younger sister), Bandit (brother-in-law), Bluey (niece), Bingo (niece)",
    "friends": "",
    "firstAppearance": "Bluey's Big Play",
    "trivia": "It is revealed Bluey didn't even know she had an aunt on her mum's side of the family.[citation needed] A younger version of Brandy can be seen pictured in Obstacle Course and Promises. The younger version of Brandy has a slightly different fur pattern, complete with light orange, brown and cream fur, cream feet, hands, eyebrows, back spots, right side of the body and head, a strip in her shoulders, right arm and tail end, light orange back, knees, start of the tail, inner ears and forehead, and brown left side of the head and outer ears. Prior to Onesies, Brandy and her sister hadn't met face-to-face in four years. Throughout the episode Onesies, it is heavily implied that Brandy has fertility problems, meaning that she may not be able to have children of her own, which may have caused her and Chilli's argument prior to Bluey's Big Play. Her last name is confirmed to be Cattle due to a movie poster art of Onesies done by Nick Rees (a lead background artist for the show).[1]",
    "absences": "",
    "gallery": "",
    "animated": "",
    "references": ""
  },
  {
    "characterName": "Busker",
    "description1": "Busker is a musician. He plays all kinds of different instruments at different venues. He has no known name, and is referred to as busker. He has no known friends or family yet.",
    "description2": "",
    "catchphrase": "",
    "appearance": "Busker is a Brussels’ Griffon with dark orange, orange, light orange, dark brown, brown and light brown fur. He has dark orange feet, hands, hair and top tail, orange legs, arms, bottom tail, stomach and head, light orange belly, eyebrows and muzzle outline, dark brown ears, brown inner ears, and a light brown muzzle. He also has a brown nose and wears brown glasses.",
    "personality": "",
    "nicknames": "",
    "breed": "Brussels griffon",
    "gender": "Male ♂",
    "age": "",
    "eyes": "Black",
    "fur": "Dark orange, orange, light orange, dark brown, brown and light brown.",
    "relatives": "",
    "friends": "",
    "firstAppearance": "Markets",
    "trivia": "His guitar is decorated with a floral pattern. And is classified as a acoustic guitar. He knows how to play the guitar and the thongaphone. He is both modelled on[1] and voiced by the show's composer, Joff Bush. He is seen spending the 5 bucks he got in Markets in The Quiet Game. Speaking of which, the same 5 bucks are foiling in his hat in Dance Mode.",
    "absences": "",
    "gallery": "",
    "animated": "",
    "references": ""
  },
  {
    "characterName": "Captain",
    "description1": "Captain is an 11 to 12 year old American Foxhound and is Mackenzie's school buddy.",
    "description2": "",
    "catchphrase": "",
    "appearance": "Captain is an American Foxhound. He has a blue-black nose, with white, brown, and dark brown fur. His ears and some of the fur surrounding them is brown. He has a black back, with a ring of brown. The rest of his fur is white. He also has brown patches on the front and a black patch on the back of his legs.",
    "personality": "",
    "nicknames": "",
    "breed": "American Foxhound",
    "gender": "Male",
    "age": "",
    "eyes": "Black",
    "fur": "Brown, Dark Brown, White",
    "relatives": "",
    "friends": "Mia, Mackenzie, Bluey Heeler",
    "firstAppearance": "Barky Boats",
    "trivia": "Captain's favourite fruits are mangoes. Like Mia, he is in year six, the last year of schooling in Australia before Secondary/High School.",
    "absences": "",
    "gallery": "",
    "animated": "",
    "references": ""
  },
  {
    "characterName": "Checkout Dog  ",
    "description1": "",
    "description2": "",
    "catchphrase": "",
    "appearance": "",
    "personality": "",
    "nicknames": "",
    "breed": "",
    "gender": "",
    "age": "",
    "eyes": "Black",
    "fur": "",
    "relatives": "",
    "friends": "",
    "firstAppearance": "",
    "trivia": "",
    "absences": "",
    "gallery": "",
    "animated": "",
    "references": ""
  },
  {
    "characterName": "",
    "description1": "",
    "description2": "",
    "catchphrase": "",
    "appearance": "",
    "personality": "",
    "nicknames": "",
    "breed": "",
    "gender": "",
    "age": "",
    "eyes": "Black",
    "fur": "",
    "relatives": "",
    "friends": "",
    "firstAppearance": "",
    "trivia": "",
    "absences": "",
    "gallery": "",
    "animated": "",
    "references": ""
  },
  {
    "characterName": "",
    "description1": "",
    "description2": "",
    "catchphrase": "",
    "appearance": "",
    "personality": "",
    "nicknames": "",
    "breed": "",
    "gender": "",
    "age": "",
    "eyes": "Black",
    "fur": "",
    "relatives": "",
    "friends": "",
    "firstAppearance": "",
    "trivia": "",
    "absences": "",
    "gallery": "",
    "animated": "",
    "references": ""
  },
  {
    "characterName": "",
    "description1": "",
    "description2": "",
    "catchphrase": "",
    "appearance": "",
    "personality": "",
    "nicknames": "",
    "breed": "",
    "gender": "",
    "age": "",
    "eyes": "Black",
    "fur": "",
    "relatives": "",
    "friends": "",
    "firstAppearance": "",
    "trivia": "",
    "absences": "",
    "gallery": "",
    "animated": "",
    "references": ""
  },
  {
    "characterName": "",
    "description1": "",
    "description2": "",
    "catchphrase": "",
    "appearance": "",
    "personality": "",
    "nicknames": "",
    "breed": "",
    "gender": "",
    "age": "",
    "eyes": "Black",
    "fur": "",
    "relatives": "",
    "friends": "",
    "firstAppearance": "",
    "trivia": "",
    "absences": "",
    "gallery": "",
    "animated": "",
    "references": ""
  },
  {
    "characterName": "",
    "description1": "",
    "description2": "",
    "catchphrase": "",
    "appearance": "",
    "personality": "",
    "nicknames": "",
    "breed": "",
    "gender": "",
    "age": "",
    "eyes": "Black",
    "fur": "",
    "relatives": "",
    "friends": "",
    "firstAppearance": "",
    "trivia": "",
    "absences": "",
    "gallery": "",
    "animated": "",
    "references": ""
  },
  {
    "characterName": "",
    "description1": "",
    "description2": "",
    "catchphrase": "",
    "appearance": "",
    "personality": "",
    "nicknames": "",
    "breed": "",
    "gender": "",
    "age": "",
    "eyes": "Black",
    "fur": "",
    "relatives": "",
    "friends": "",
    "firstAppearance": "",
    "trivia": "",
    "absences": "",
    "gallery": "",
    "animated": "",
    "references": ""
  },
  {
    "characterName": "",
    "description1": "",
    "description2": "",
    "catchphrase": "",
    "appearance": "",
    "personality": "",
    "nicknames": "",
    "breed": "",
    "gender": "",
    "age": "",
    "eyes": "Black",
    "fur": "",
    "relatives": "",
    "friends": "",
    "firstAppearance": "",
    "trivia": "",
    "absences": "",
    "gallery": "",
    "animated": "",
    "references": ""
  },
  {
    "characterName": "",
    "description1": "",
    "description2": "",
    "catchphrase": "",
    "appearance": "",
    "personality": "",
    "nicknames": "",
    "breed": "",
    "gender": "",
    "age": "",
    "eyes": "Black",
    "fur": "",
    "relatives": "",
    "friends": "",
    "firstAppearance": "",
    "trivia": "",
    "absences": "",
    "gallery": "",
    "animated": "",
    "references": ""
  },
  {
    "characterName": "",
    "description1": "",
    "description2": "",
    "catchphrase": "",
    "appearance": "",
    "personality": "",
    "nicknames": "",
    "breed": "",
    "gender": "",
    "age": "",
    "eyes": "Black",
    "fur": "",
    "relatives": "",
    "friends": "",
    "firstAppearance": "",
    "trivia": "",
    "absences": "",
    "gallery": "",
    "animated": "",
    "references": ""
  },
  {
    "characterName": "",
    "description1": "",
    "description2": "",
    "catchphrase": "",
    "appearance": "",
    "personality": "",
    "nicknames": "",
    "breed": "",
    "gender": "",
    "age": "",
    "eyes": "Black",
    "fur": "",
    "relatives": "",
    "friends": "",
    "firstAppearance": "",
    "trivia": "",
    "absences": "",
    "gallery": "",
    "animated": "",
    "references": ""
  },
  {
    "characterName": "",
    "description1": "",
    "description2": "",
    "catchphrase": "",
    "appearance": "",
    "personality": "",
    "nicknames": "",
    "breed": "",
    "gender": "",
    "age": "",
    "eyes": "Black",
    "fur": "",
    "relatives": "",
    "friends": "",
    "firstAppearance": "",
    "trivia": "",
    "absences": "",
    "gallery": "",
    "animated": "",
    "references": ""
  },
  {
    "characterName": "",
    "description1": "",
    "description2": "",
    "catchphrase": "",
    "appearance": "",
    "personality": "",
    "nicknames": "",
    "breed": "",
    "gender": "",
    "age": "",
    "eyes": "Black",
    "fur": "",
    "relatives": "",
    "friends": "",
    "firstAppearance": "",
    "trivia": "",
    "absences": "",
    "gallery": "",
    "animated": "",
    "references": ""
  },
  {
    "characterName": "Socks",
    "description1": "Muffin’s baby sister is just starting to talk.",
    "description2": "",
    "catchphrase": "",
    "appearance": "",
    "personality": "",
    "nicknames": "",
    "breed": "",
    "gender": "",
    "age": "",
    "eyes": "Black",
    "fur": "",
    "relatives": "",
    "friends": "",
    "firstAppearance": "",
    "trivia": "",
    "absences": "",
    "gallery": "",
    "animated": "",
    "references": ""
  }
]
