[
  {
    "shortName": "Archaeology",
    "plot": "At a lecture, Marcus introduces Doctor Bandit Heeler, who presents a fossilized bone from his archaeological research. As Bandit explains, the bone provides evidence of the evolution of modern bipedal dogs from distant, quadrupedal ancestors. However, after concluding his remarks, Bandit begins gnawing on the fossil, demonstrating that two-legged dogs aren't so different from the four-legged variety.",
    "characters": "Bandit Heeler, Marcus",
    "trivia": "The building in which Bandit gives his lecture is the 1 William Street skyscraper in the Brisbane CBD. This short was released outside of Australia for the first time on the Bluey: Seasons 1 & 2 DVD set.",
    "url": "https://www.facebook.com/OfficialBlueyTV/videos/527072192353250",
    "premiereDate": "April 1, 2022"
  },
  {
    "shortName": "Bingo's Dance Lesson",
    "plot": "Bingo is joined by former yellow Wiggle, Emma Watkins, at the Old Museum Building in Brisbane, where she teaches Bingo how to dance.",
    "characters": "Bingo Heeler",
    "trivia": "This marks the first official live action piece of Bluey media. This video features Emma Watkins (a.k.a Emma Memma), who was formally a member of The Wiggles from 2013 to 2021. This marks the second time a Wiggles member was in Bluey. the first was Anthony Field, who voiced Postie and Rusty's Dad. Both of the members appeared in an image in Phones. This marks the first time humans are present in Bluey. The video uses music from the episode Omelette.",
    "url": "https://blueypedia.fandom.com/wiki/File:Bingo%27s_Dance_Lesson_%F0%9F%A7%A1_feat._Emma_Memma_-_Bluey",
    "premiereDate": "May 11, 2023"
  },
  {
    "shortName": "Cinderella",
    "plot": "Bandit is telling Bluey and Bingo a Cinderella story but in a funny way.",
    "characters": "Bluey Heeler, Bingo Heeler, Bandit Heeler, Chilli Heeler",
    "trivia": "This could be a reference to the 'Story Game' in Fruitbat, as it is similar to the game, as the book he's reading to the children is also another fairytale. This is the longest Bluey short.",
    "url": "https://blueypedia.fandom.com/wiki/File:A_Bluey_Cinderella_Story_%F0%9F%92%99%E2%9C%A8-_BRAND_NEW_ORIGINAL_-_Bluey",
    "premiereDate": "April 8, 2021"
  },
  {
    "shortName": "Crazy Christmas Lights",
    "plot": "Bingo plays with the light settings on the Christmas tree. First Bingo turns them on, then she turns them off. Then she makes them flash, and makes them flash again. She then makes them stay lit, then she turns them dark. Then she makes them flash again. Bingo now makes the lights flash fast. Then she makes them go dark, and then light. Now she makes the lights are flashing rapidly, surprising Bingo and Bluey.",
    "characters": "Bluey, Bingo",
    "trivia": "While Bluey appears in this short, she doesn't talk in it. This short may be a continuation to Verandah Santa, along with Jingle Bells. Bluey is depicted reading, but she can't read in some episodes. However, Bluey could just be looking at pictures.",
    "url": "https://blueypedia.fandom.com/wiki/File:Crazy_Christmas_Lights_%F0%9F%8E%84-_Bluey",
    "premiereDate": "December 21, 2019"
  },
  {
    "shortName": "Flying Saucer",
    "plot": "Bluey and Bingo sing the Flying Saucer nursery rhyme while riding in the car.",
    "characters": "Bluey Heeler, Bingo Heeler, Chilli Heeler, Rocko, Mrs. Retriever",
    "trivia": "The titular song is a mangled version of an Ella Fitzgerald song from 1951[1]. This is the first short to take place in the car. This is the fifth short not to air in December. This is the fifth short that is not Christmas-themed.",
    "url": "https://blueypedia.fandom.com/wiki/File:Flying_Saucer_-_BRAND_NEW_ORIGINAL_-_Bluey",
    "premiereDate": "March 17, 2021"
  },
  {
    "shortName": "Fun in the Car!",
    "plot": "Let's go in the car with the heelers as its time to go to the pool!",
    "characters": "Bluey Heeler, Bingo Heeler, Bandit Heeler, Chilli Heeler",
    "trivia": "This is the second short in which all four main characters appear. This is the first toy stop motion short. This short still has they voice actors of the original show. In the short and the show the vehicle is mostly based off a 2012 Jeep Wrangler and 2009 Land Rover Discovery 3 and 2013 Land Rover Discovery 4, while the front is based off a Jeep Wrangler and the rear based off the Land Rover Discovery 3 & 4 series.",
    "url": "https://blueypedia.fandom.com/wiki/File:Fun_in_the_Car!_-_Bluey_and_Bingo%27s_Playtime_-_Toy_Stop_Motion_-_Bluey",
    "premiereDate": "May 23, 2021"
  },
  {
    "shortName": "Green Bottles",
    "plot": "Bingo kicks down the pinecones that are on the porch and counts them from ten to zero.",
    "characters": "Bingo Heeler, Chilli Heeler",
    "trivia": "This marks the second short where Bluey is absent. This is the longest Bluey short. When bingo throws away the sixth bottle, the eighth bottle disappears, but then comes back again. The short was released on the Bluey: Queens And Other Stories Vol 9 (DVD) on March 24, 2021",
    "url": "https://blueypedia.fandom.com/wiki/File:10_Green_Bottles_-_BRAND_NEW_ORIGINAL_-_Bluey",
    "premiereDate": "April 21, 2021"
  },
  {
    "shortName": "Highball",
    "plot": "Pat is going to teach Bluey and Lucky to put up a high ball. Bluey and Lucky then make funny faces while Pat's stretching and showing them how to kick the ball. The kids were busy playing, so Pat puts a stop to it and tells the kids to pay attention. Pat then shows them to do a high ball, but Bluey and Lucky run away. Pat then turns around seeing that the kids are gone, resulting the ball to hit Pat's head.",
    "characters": "Bluey Heeler, Lucky, Pat",
    "trivia": "This is the second short where one of Bluey's friends appear. First being Tea Party with Bluey where Honey appears. The short was released on the Bluey: Queens And Other Stories Vol 9 (DVD) on March 24, 2021. This short marks a few first things about Pat and Lucky. This marks Pat’s first speaking role since Queens. This marks Pat’s first appearance since Circus. This marks Lucky’s first appearance and speaking role since Handstand",
    "url": "https://blueypedia.fandom.com/wiki/File:Highball_-_BRAND_NEW_ORIGINAL_-_Bluey",
    "premiereDate": "July 2, 2021"
  },
  {
    "shortName": "Honk",
    "plot": "Socks asks Stripe to play 'Honk', in which his nose honks whenever it is pressed. Stripe insists that his nose doesn't honk and presses it to prove it, but much to Socks' delight, his nose honks every time she's the one that presses it. Muffin tries pressing Stripe's nose too, but he claims it only honks when Socks does it. Muffin decides she needs to press harder, and ends up smacking Stripe in the face.",
    "characters": "Stripe, Socks, Muffin",
    "trivia": "This is the first short that is mainly focused on Stripe Heeler's children; Muffin Heeler, and Socks Heeler. This is also the first short in Stripe's Family's House. This short first introduces us to Socks growing up and walking. On the Bluey official website, this short, along with others, is shown with on-screen subtitles. As Socks runs into shot, the black fur covering her left eye enlarges and covers most of the upper part of her face. However, when she stands still to ask Stripe to play Honk, her fur is back to normal. The short was originally longer showing footage of Muffin smacking Stripe in the face. When the short was released online the last moment was cut short. The full version is released as a Bonus Bit on Bluey: Explorers and Other Stories Vol 13 (DVD).",
    "url": "https://blueypedia.fandom.com/wiki/File:Honk_-_Brand_New_Original_-_Bluey",
    "premiereDate": "June 18, 2021"
  },
  {
    "shortName": "Humpty Dumpty",
    "plot": "Chilli records Muffin singing Humpty Dumpty for grandad.",
    "characters": "Bluey Heeler, Bingo Heeler, Chilli Heeler, Muffin Heeler, Socks Heeler, Bob Heeler (mentioned), Bandit Heeler (pictured)",
    "trivia": "This is the first short where Bluey's cousins, Muffin and Socks, appear. This is the third short not to air in December. This is the third short that is not Christmas-themed. This is the fourth short with a title card. This is the third short to take place in the daytime. This short makes the first mentioning of Bob Heeler ever since he appeared in 'Grannies'. Muffin and Chilli are the only characters to speak in this short. Although it shows Bluey, Bingo, and Socks Laughing. When Bluey, Bingo and Socks Laugh, Socks has a strange facial expression. In the lyrics, Muffin was seen wearing a tutu is a reference in Charades. Some viewers mistook Grandpa Bob for Grandad Mort, but it is unknown which grandad they were talking about. It is possibly Bob, as Mort does not own a phone. It is possible that they were talking about Trixie's father instead of Mort. It is unconfirmed, but some say that the voices of the children were recorded in the same recording room. It is unknown if it is true.",
    "url": "https://blueypedia.fandom.com/wiki/File:Humpty_Dumpty_-_BRAND_NEW_ORIGINAL_-_Bluey",
    "premiereDate": "March 12, 2021"
  },
  {
    "shortName": "Jingle Bells",
    "plot": "Inside Bluey's house (from Veranda Santa), Bluey and Bingo sneakily go to their Christmas tree at night and shake their presents. Then, they sing the famous Christmas carol, 'Jingle Bells', but with a Heeler twist!",
    "characters": "Bluey, Bingo, Bandit",
    "trivia": "This is the first short that has a title card. This short might be a continuation to Verandah Santa, along with Crazy Christmas Lights. Bluey and Bingo are singing the parody song 'Jingle Bells, Batman Smells'. The first version is how some Australian usually sing it. It goes, 'Jingle bells, Batman smells. Robin ran away. He lost his pants, down in France, and found them in Norway, hey!'. It's a variant of the original British version where the second line goes, 'Robin flew away', and last line goes, 'and found them in Bombay/Pompeii'. When Bluey and Bingo sing another parody of “Jingle Bells”, the phrase “The Batmobile lost a wheel and the Joker got away” could be a reference to Batman - The Dark Knight. It goes, 'Jingle bells, Batman smells. Robin laid an egg. The Batmobile lost a wheel and the Joker got away, hey!'. This second version the girls sing is how Americans usually sing it. It became widespread due to an episode of the Simpsons. Specifically, $pringfield (Or, How I Learned to Stop Worrying and Love Legalized Gambling). This short aired two times on the bluey youtube channel. This short is rereleased with on-screen subtitles as of 2021.",
    "url": "https://blueypedia.fandom.com/wiki/File:Jingle_Bells_-_Bluey_Christmas%F0%9F%8E%84_-_Bluey",
    "premiereDate": "December 10, 2020"
  },
  {
    "shortName": "K9 News",
    "plot": "Snickers pretends to be a news reporter on a channel called 'K9 News' at Calypso’s School.",
    "characters": "Snickers, Mackenzie, Bluey, Winton, Rusty, Jack Russell, The Terriers",
    "trivia": "This is the first short: To feature Bluey's friends in Calypso’s School. To take place outside of a Heeler's residence. Snickers appears without his cap a few times in this short. K9 News features the most characters out of any short, with nine. Mackenzie digging is a reference to Mums and Dads. Snickers doing the traffic report, with Bluey flying a Helicopter, is a callback to their interaction in Helicopter. This marks Rusty’s first speaking role since Handstand. Mackenzie's 'Ah, I hit the bottom!' line from Mums and Dads is reused in this short. Rusty's 'They're everywhere!' line is also reused.",
    "url": "",
    "premiereDate": "September 24, 2021"
  },
  {
    "shortName": "Let's play hide and seek!",
    "plot": "Let's play hide and seek! is the thirteenth Bluey short. It aired on May 30, 2021.",
    "characters": "Bandit Heeler, Bingo Heeler, Bluey Heeler, Chilli Heeler",
    "trivia": "This is the second toy stop motion short. This is the longest Bluey short with a runtime of 3:26.",
    "url": "https://blueypedia.fandom.com/wiki/File:Let%27s_play_hide_and_seek!_-_Bluey_and_Bingo%27s_Playtime_-_Toy_Stop_Motion_-_Bluey",
    "premiereDate": "May 30, 2021"
  },
  {
    "shortName": "Make Mum Laugh",
    "plot": "Bluey and Bingo are given the challenge to try to make Chilli laugh by making silly faces",
    "characters": "Bluey, Bingo, Chilli",
    "trivia": "Bluey and Bingo make funny faces that are memes.",
    "url": "https://blueypedia.fandom.com/wiki/File:Make_Mum_Laugh_-_BRAND_NEW_ORIGINAL_-_Bluey",
    "premiereDate": "June 1, 2021"
  },
  {
    "shortName": "Mower",
    "plot": "Bandit tries to make the lawnmower to work while getting frustrated.",
    "characters": "Bandit Heeler, Bluey Heeler, Bingo Heeler",
    "trivia": "Mower is the first short in which only one character appears. This marks the third short where Bluey is absent",
    "url": "https://blueypedia.fandom.com/wiki/File:Mower_-_Brand_New_Original_-_Bluey",
    "premiereDate": "June 10, 2021"
  },
  {
    "shortName": "Old MacDonald",
    "plot": "The family plays a game of 'Old MacDonald', where Chilli names an animal and the rest of the family imitate it: Bingo becomes a pig. Bandit becomes a peacock. Bluey becomes a bluefish. Bluey and Bingo become monkeys. Chilli then declares that Old MacDonald had dinosaurs on his farm, and Bluey, Bingo, and Bandit become dinosaurs and chase her.",
    "characters": "Bandit Heeler, Bingo Heeler, Bluey Heeler, Chilli Heeler",
    "trivia": "This marks the first short in which all four main characters appear. This marks the first episode to have on-screen subtitles. Chilli's line, 'a dinosaur park is a terrible idea!' is a reference to Jurassic Park.",
    "url": "https://blueypedia.fandom.com/wiki/File:Old_Macdonald_-_BRAND_NEW_ORIGINAL_-_Bluey",
    "premiereDate": "May 20, 2021"
  },
  {
    "shortName": "One Man Went To Mow",
    "plot": "Bingo decides to use the toilet (dunny), while sitting she sings “One Man Went To Mow” while she sits on the toilet. Although she only sing up to five man went to mow, she looks down only realising that she didn’t go at all (rather than Bingo usually do a tactical wee or “a wee turned into a poo”). Bingo looks down once more before flushing the toilet and leaves the toilet.",
    "characters": "Bingo Heeler",
    "trivia": "This is the closest to a Bluey toilet training video Bingo’s song “One Man Went To Mow” is heard again since the episode Spy Game. Despite the toilet paper is shown in the title card, Bingo doesn’t use it at all. This marks Bingo’s first time using the toilet since the episode Favourite Thing.",
    "url": "https://www.youtube.com/watch?v=FdvhEaV0xLw",
    "premiereDate": "June 1, 2022"
  },
  {
    "shortName": "Pea Pod Sausages",
    "plot": "Bingo is sitting on the dining table, drawing and singing a couple of nursery rhymes: 'Five Fat Peas' and 'Five Fat Sausages'. In the end, she gets her own plate of sausage from her dad.",
    "characters": "Bingo Heeler, Bandit Heeler",
    "trivia": "Bluey is absent in this shortCoupled with this is that there is a toy blue-tongued lizard 'a bluey' on the table.This is the first time Bluey has been absent in a short.",
    "url": "https://blueypedia.fandom.com/wiki/File:Pea_Pod_Sausages_-_BRAND_NEW_ORIGINAL_-_Bluey",
    "premiereDate": "March 25, 2021"
  },
  {
    "shortName": "Scooter Fun!",
    "plot": "Scooter Fun! is the nineteenth Bluey short.",
    "characters": "Bingo Heeler, Bluey Heeler",
    "trivia": "This is the third toy stop motion short. This is the first short where there is no dialogue.",
    "url": "https://blueypedia.fandom.com/wiki/File:Scooter_Fun!%F0%9F%9B%B4_-_Bluey_and_Bingo%27s_Playtime_-_Toy_Stop_Motion_-_Bluey",
    "premiereDate": "November 16, 2021"
  },
  {
    "shortName": "Silent Night (before Christmas)",
    "plot": "Bandit is humming Silent Night while Bingo is sleeping in Bluey and Bingo's bedroom. Bandit then sneaks away but is interrupted when Bingo wakes up and asks a question to him, Bandit then answers it and she [Bingo] goes back to sleep while Bandit looks at the viewer confused",
    "characters": "Bandit Heeler, Bingo Heeler, Bluey Heeler",
    "trivia": "Bandit and Bingo are the only two characters who speak in this short video while Bluey is sleeping in the background. This episode may be a prequel to Verandah Santa after the day this short took place. This video has a short running time, approximately 57 seconds (about a 1 minute video). Bandit breaks the fourth wall by looking at the audience confused (This is the second time this has ever happened in Bluey history, the first was in Grannies) The first Bluey Short is a Christmas short.",
    "url": "https://blueypedia.fandom.com/wiki/File:Silent_Night_(Before_Christmas)_%E2%9D%84%EF%B8%8F-_Bluey",
    "premiereDate": "December 17, 2019"
  },
  {
    "shortName": "Tea Party with Bluey",
    "plot": "Honey and Bluey host a tea party! Honey's Dad has lots of requests for how a tea party should go.",
    "characters": "Bluey, Honey, Marcus, Daisy",
    "trivia": "This is the first short where one of Bluey's friends appear. This is the second short not to air in December. This is the second short that is not Christmas-themed. This is the third short with a title card. This is the second short to take place in the daytime. The Title Card is misspelled as 'Tea Party'.",
    "url": "https://blueypedia.fandom.com/wiki/File:Tea_Party_with_Bluey_-_BRAND_NEW_ORIGINAL_-_Bluey",
    "premiereDate": "March 5, 2021"
  },
  {
    "shortName": "The Lollipop Song",
    "plot": "Bluey and Bingo go into the hallway with Mum's radio, and dance until it is taken away. The girls then use Chattermax.",
    "characters": "Bluey, Bingo, Chilli, Chattermax",
    "trivia": "This is the first short where Chilli appears. This is the first short not to air in December. This is the first short that is not Christmas-themed. This is the second short with a title card, after Jingle Bells. Chattermax is used for the first time since The Show. This is the first short to take place in the daytime. This is also the first short to show three rooms at once. This short confirms that the bathroom with a tub and shower is not the master bathroom. Bluey does her dance based on the end credits in this short. Most of the animation in this short is re-used from the intro. Bingo's dancing is shown in the intro of the episode Bingo with a little bit of 'Behind the Scenes: Dancing Edition' and flossing. This short is the first short that has Chattermax in it. This is the first appearance of Bluey and Bingo flossing in a short. The song's lyrics are based off of an American-Japanese meme and video Nyan Cat. as if the song infinitely loops and both repeat lyrics, but also can get very annoying. The song also is similar to the song Lolipop by the female quartet The Chordettes. as if both songs are written about lollipops, however, the only difference is that the song is based off of Nyan Cat as stated above. whereas Lolipop is a song about what a Lolipop is. ",
    "url": "https://blueypedia.fandom.com/wiki/File:The_Lollipop_Song!_-_Bluey_Music_-_BRAND_NEW_BLUEY_-_Bluey",
    "premiereDate": "January 11, 2021"
  },
  {
    "shortName": "Tongue Twisters",
    "plot": "Bluey and Bingo are trying some funny tongue twisters.",
    "characters": "Bluey Heeler, Bingo Heeler",
    "trivia": "The short was originally uploaded to the official Bluey YouTube channel before it was quickly taken down. There was no official statement on why the short was taken down, though it has been speculated that it was due to an error of the shows intro playing at the end rather than the shorts ending jingle. The short would be referred to as lost media as it did not surface again. It would however later appear on Bluey: Queens And Other Stories Vol 9 (DVD) as one of the three bonus bits. Another possibility is that the short shows Bluey reading at an advanced level. While Bluey is sometimes shown looking at picture books, she's never been shown undeniably reading, as she is here.",
    "url": "https://www.youtube.com/watch?v=ValIMj7TA2A",
    "premiereDate": "January 1, 2020"
  }
]
