[
  {
    "locationName": "Heeler Family's Home",
    "description": "The Heeler Family’s House is an old Queenslander household situated on the end of a cul de sac. It has a poinciana tree, a front yard, a back yard and 2 levels and a view of the city. Its rooms include Bandit and Chilli Heeler's Bedroom and Bluey and Bingo Heeler's Bedroom.",
    "appearance": "The Heeler Family’s House has cream, wooden walls, white fences and accents, a red roof and brick supports.",
    "rooms": "Living Room, Sitting Room, Foyer, Backyard, Frontyard, Bandit and Chilli's Bedroom, Bluey and Bingo's Bedroom, Spare Bedroom, Linen Closet, Kitchen, Dining Room, Balcony, Verandah, Second Dining Room, Playroom, Garage, Study, Bathroom, Hall Toilet, Laundry Room, Sun Room, Crawlspace",
    "appearances": "The Magic Xylophone, Hotel, Bob Bilby, Yoga Ball, Bad Mood, Bedroom, Promises, Omelette, Born Yesterday, Unicorse",
    "inhabitants": "Bluey Heeler, Bingo Heeler, Bandit Heeler, Chilli Heeler",
    "inconsistencies": "",
    "trivia": "",
    "gallery": ""
  },
  {
    "locationName": "Chloe's Family's Home",
    "description": "Chloe's house is where Chloe and her family live. It is rather spacious and seems to have a modern theme or aesthetic, with the left side of the house having a window wall. There's also a glass fish tank in the living room. The family's address number is 101.",
    "appearance": "The house has a modern aesthetic, with a large window wall on the left side and a glass fish tank in the living room.",
    "rooms": "Entryway, Living Room",
    "appearances": "Octopus",
    "inhabitants": "Chloe, Frank, Chloe's Mom",
    "inconsistencies": "",
    "trivia": "The number 101 is likely a reference to a 1956 book 'The Hundred and One Dalmatians' by Dodie Smith, and its popular film adaptations produced by Disney in 1961 and 1996.",
    "gallery": ""
  },
  {
    "locationName": "Crazy World",
    "description": "CrazyWorld is an Amusement Park that the Heelers went to in Mt. Mumandad. It features rides, attractions, and a giant statue of a purple squirrel in the center. The squirrel seems to be its mascot. Bluey and Bingo had bought teddies, a magic wand, and a backpack with a flag back home from the gift shop.",
    "appearance": "CrazyWorld features a variety of rides and attractions, with a giant purple squirrel statue as its mascot.",
    "rooms": "12 attractions",
    "appearances": "Mt. Mumanddad",
    "inhabitants": "Bluey, Bingo, Bandit, Chilli, other park visitors, staff members",
    "inconsistencies": "The park’s layout appears to change between episodes, with different rides being shown in 'Mt. Mumanddad' that don't always match previous appearances.",
    "trivia": "CrazyWorld’s giant purple squirrel statue is one of the park's main features and serves as its mascot. It's a fun, family-friendly amusement park, likely inspired by real-world theme parks in Australia.",
    "gallery": "Scenes from 'Mt. Mumanddad' showcasing the rides, attractions, and the iconic purple squirrel statue in the center of CrazyWorld."
  },
  {
    "locationName": "Glasshouse Primary School",
    "description": "Glasshouse Primary School is a school for older kids, operated by Calypso. As per most Steiner/Waldorf schools, it does not have a specific age range for children.",
    "appearance": "The building is mostly made of wood, featuring natural materials and rounded shapes in line with Waldorf educational principles for early childhood.",
    "rooms": "Classrooms, Hallways, Courtyard, Teacher’s Lounge",
    "appearances": "Calypso, The Adventure, Early Baby, Mums and Dads, Daddy Dropoff, Army, Helicopter, Barky Boats, Typewriter, Explorers, Stories, Space, Wild Girls, TV Shop, Cricket",
    "inhabitants": "Calypso, Bluey, Chloe, Indy, Rusty, Honey, The Terriers, Pretzel, Coco, Snickers, Mackenzie, Winton, Jack",
    "inconsistencies": "",
    "trivia": "This school is based off of a Steiner school in Samford Valley.",
    "gallery": ""
  },
  {
    "locationName": "Golden Crown",
    "description": "The Golden Crown is the main location in the episode 'Takeaway'.",
    "appearance": "A metallic red and gold sign that says 'Takeaway' sits on the window with Chinese lettering. The roof is blue, and there are displays of food. Inside, there is a red soda machine.",
    "rooms": "Entrance, Dining Area",
    "appearances": "Takeaway",
    "inhabitants": "Takeaway Lady",
    "inconsistencies": "",
    "trivia": "Their menu includes Wonton soup, Orange chicken, Pot stickers, Fried rice, Fortune cookies, Spring Rolls, Noodles.",
    "gallery": ""
  },
  {
    "locationName": "Trampolinium",
    "description": "In the episode 'Promises', Bandit chases Bluey and Bingo around a play area. The scene cuts to the two girls and Bandit in the car.",
    "appearance": "An open area with large trampolines and a lot of space to jump around.",
    "rooms": "Trampoline Area",
    "appearances": "Promises",
    "inhabitants": "",
    "inconsistencies": "",
    "trivia": "The trampoline area was a key location for the chase scene between Bandit and the girls in 'Promises'.",
    "gallery": "Images from the 'Promises' episode featuring the large trampoline area and the fun chase."
  },
  {
    "locationName": "Kindy",
    "description": "The Kindy is a kindergarten operated by Mrs. Retriever in Bluey.",
    "appearance": "The building has cream-colored walls both inside and outside, and a warm and welcoming atmosphere.",
    "rooms": "Playroom, Art Room, Nap Room, Entrance",
    "appearances": "Bob Bilby, Daddy Dropoff, Show and Tell, Slide",
    "inhabitants": "Mrs. Retriever, Bingo, Lila, Juniper, Buddy, Bentley, Missy, Harley, Jasper W, Jasper G, Sadie, Zara, Banjo, Felix",
    "inconsistencies": "",
    "trivia": "",
    "gallery": "Images from episodes like 'Bob Bilby' and 'Daddy Dropoff' that show the vibrant interior of the Kindy with children engaging in activities."
  },
  {
    "locationName": "Border Collie Family's House",
    "description": "Mackenzie's family house is a traditional single-story Queenslander. The property has a driveway and a front yard with bushes. The house has yellow paint on the exterior and a red roof.",
    "appearance": "A bright yellow Queenslander with a red roof and a spacious front yard.",
    "rooms": "Mackenzie's Bedroom, Living Room, Kitchen",
    "appearances": "Fruitbat, Curry Quest",
    "inhabitants": "Mackenzie, Mackenzie’s Mum, Mackenzie’s Dad",
    "inconsistencies": "",
    "trivia": "",
    "gallery": "Scenes from 'Fruitbat' and 'Curry Quest' that feature Mackenzie's home."
  },
  {
    "locationName": "The Big Peanut",
    "description": "The Big Peanut is a statue of an anthropomorphic peanut wearing a cork hat. One of Australia's Big Things.",
    "appearance": "The statue is approximately 50 feet high, brown all over with a green cork hat. The peanut man is posed to be smiling and waving.",
    "rooms": "Outside, Entrance",
    "appearances": "Road Trip, Pass the Parcel, Smoochy Kiss",
    "inhabitants": "",
    "inconsistencies": "",
    "trivia": "Bluey's Map of Brisbane gives a location for the Big Peanut. There was a real life Big Peanut at the Peanut Place in Tolga, which closed in 2019.",
    "gallery": ""
  },
  {
    "locationName": "Stripe's Family's House",
    "description": "Stripe's family house has a modern tropical theme with many tropical plants around. It includes a pool and a gazebo in the backyard.",
    "appearance": "A tropical-themed home with lots of greenery and outdoor spaces.",
    "rooms": "Living Room, Kitchen, Pool Area, Bedroom, Backyard",
    "appearances": "The Pool, Christmas Swim, Faceytalk, Honk",
    "inhabitants": "Stripe Heeler, Trixie Heeler, Muffin Heeler, Socks Heeler",
    "inconsistencies": "",
    "trivia": "Stripe is the only Heeler to have a pool.",
    "gallery": ""
  },
  {
    "locationName": "Space",
    "description": "Space is a restaurant play place in Bluey, first appearing in the episode 'Mr. Monkeyjocks'.",
    "appearance": "The space is filled with vibrant colors and a kid-friendly atmosphere with lots of activity and excitement.",
    "rooms": "Dining Area, Play Area",
    "appearances": "Mr. Monkeyjocks, Pass the Parcel",
    "inhabitants": "Bluey, Bingo, Bandit, Chilli, Mr. Monkeyjocks, other kids",
    "inconsistencies": "The play area seems to change its layout between episodes, as seen in 'Mr. Monkeyjocks' compared to 'Pass the Parcel'.",
    "trivia": "The restaurant’s play area is designed to be a typical indoor play space that would appeal to younger children, with features like climbing walls and a slide.",
    "gallery": "Scenes from 'Mr. Monkeyjocks' and 'Pass the Parcel' showcasing the vibrant colors and exciting play space layout."
  },
  {
    "locationName": "Airport",
    "description": "The Airport in the show is based on Brisbane Airport, which is one of the busiest in Australia.",
    "appearance": "A bustling airport with long hallways, gates, and various terminals.",
    "rooms": "Main Terminal, Gate Area, Check-in",
    "appearances": "Curry Quest",
    "inhabitants": "Bluey, Bingo, Bandit, Chilli, other passengers, airport staff",
    "inconsistencies": "The airport layout in 'Curry Quest' doesn't fully match real-world Brisbane Airport, especially in terms of the terminal designs and sizes.",
    "trivia": "The airport is based on the real Brisbane Airport, which is an international airport serving the city of Brisbane, Australia.",
    "gallery": "Images from 'Curry Quest' showcasing the bustling airport with passengers and the various terminals."
  },
  {
    "locationName": "Benjamina Place Park",
    "description": "Benjamina Place Park is a small park with a swingset, brick barbecue, and basketball key. It's located in The Gap.",
    "appearance": "A small, cozy park with a few benches, a swingset, and a barbecue area.",
    "rooms": "Park Area",
    "appearances": "Turtleboy",
    "inhabitants": "Bluey, Bingo, Bandit, Chilli, and various local families",
    "inconsistencies": "The park seems more spacious in the show compared to the real Benjamina Place Park, as seen in 'Turtleboy'.",
    "trivia": "This park is located in The Gap, a suburb in Brisbane, and is a fictionalized version of a real local park.",
    "gallery": "Scenes from 'Turtleboy' showing Bluey and Bingo playing in the park, with the swingset and barbecue area as key features."
  },
  {
    "locationName": "Currimundi Beach",
    "description": "Currimundi Beach is the location for the Heeler family's holiday in the episodes 'Relax' and 'Stickbird'.",
    "appearance": "A beautiful beach with soft sand, clear blue water, and plenty of room for family fun.",
    "rooms": "Beachfront, Sand Dunes, Picnic Area",
    "appearances": "Relax, Stickbird",
    "inhabitants": "Bluey, Bingo, Bandit, Chilli, other beachgoers",
    "inconsistencies": "The layout of Currimundi Beach appears slightly altered between episodes, especially regarding the position of key landmarks like the sand dunes.",
    "trivia": "Currimundi Beach is a real beach located on the Sunshine Coast in Queensland, Australia, known for its calm waters and family-friendly atmosphere.",
    "gallery": "Scenes from 'Relax' and 'Stickbird' showcasing the beautiful beach with clear blue water, sand dunes, and the picnic area where the Heelers relax."
  },
  {
    "locationName": "Fitzroy Island",
    "description": "Fairytale had Bandit a story of him as a child on holiday with his parents (Bob, Chris) and brothers (Rad and Stripe) back in the 1980s. While no location is given for where the holiday is set, it is a seaside resort with wide open spaces. It is mostly considered to be The resort on Fitzroy Island, which is in the far north of Queensland and is separate from the continental mainland (Cairns, which is where ferries depart from for the island, is at least a day's drive from Brisbane). The resort has high prices, with prices of over AU$2,000 for a week in the summer.",
    "appearance": "Fairytale",
    "rooms": "Resort rooms, beachfront cottages",
    "appearances": "Fairytale",
    "inhabitants": "Bandit, Bob, Chris, Rad, Stripe",
    "inconsistencies": "None",
    "trivia": "The island is known for its coral reefs and tropical rainforest.",
    "gallery": "images/fitzroy_island_1.jpg"
  },
  {
    "locationName": "Florence Café",
    "description": "Bluey and Bingo want ice creams, and ask Bandit to take them. He only agrees to but does Ragdoll to teach them of hard work. With Wendy's help, they make it to a café and enjoy their frozen foods. The café has a similar design to Florence Cafe, which is in Camp Hill area of South Brisbane.",
    "appearance": "Ragdoll",
    "rooms": "Indoor and outdoor seating, ice cream counter",
    "appearances": "Ragdoll",
    "inhabitants": "Bluey, Bingo, Bandit, Wendy",
    "inconsistencies": "None",
    "trivia": "Florence Café is inspired by real-life cafes in Brisbane.",
    "gallery": "images/florence_cafe.jpg"
  },
  {
    "locationName": "The Gap",
    "description": "In Pass the Parcel, invites are sent to the numerous birthday parties shown in the episode, one of which is for Missy's. Her invite shows the words for The Gap, which is an upmarket suburb 10KM west of Brisbane.",
    "appearance": "Pass the Parcel",
    "rooms": "Party areas, suburban streets",
    "appearances": "Pass the Parcel",
    "inhabitants": "Missy, Bluey, Bingo, Bandit",
    "inconsistencies": "None",
    "trivia": "The Gap is known for its quiet, residential character.",
    "gallery": "images/the_gap.jpg"
  },
  {
    "locationName": "Hammerbarn",
    "description": "In the episode of the same name, The Hammerbarn Store is located to the north of Brisbane, and is a direct copy of a Bunnings Warehouse store located in Keperra, which is to the northwest of Brisbane, and the closest such store to Paddington. Bunnings itself is a hardware store, similar to B&Q in the UK or House Depot in the USA, and the logo used for Hammerbarn is essentially a copy of the Bunnings hammer.",
    "appearance": "Hammerbarn",
    "rooms": "Aisles of tools, garden center",
    "appearances": "Hammerbarn",
    "inhabitants": "Bandit, Bluey, Bingo",
    "inconsistencies": "None",
    "trivia": "Hammerbarn is a parody of Bunnings Warehouse.",
    "gallery": "images/hammerbarn.jpg"
  },
  {
    "locationName": "Latrobe Terrace",
    "description": "In Dance Mode, Bandit, Chilli, Bluey and Bingo are having an outing and are eating at a Café. They have a window seat, with a building seen behind them. This building, with a flower as a logo, is similar to Flowers Of The World, located in Paddington, Brisbane. The same Café (which is probably The Java Lounge) is shown in Favourite Thing, as is the botanists. However, since the family sit outside, there is a better view of the surroundings, such as a bus stop with shelter. This bus stop, due to its location and unique design, is Trammies Corner, which has frequent services from the city centre.",
    "appearance": "Dance Mode, Favourite Thing",
    "rooms": "Café, outdoor seating",
    "appearances": "Dance Mode, Favourite Thing",
    "inhabitants": "Bandit, Chilli, Bluey, Bingo",
    "inconsistencies": "None",
    "trivia": "Latrobe Terrace is a popular spot in Paddington, Brisbane.",
    "gallery": "images/latrobe_terrace.jpg"
  },
  {
    "locationName": "The Library",
    "description": "In Promises, The Heeler family enter a library to take out and return some books. This library is based off the Ashgrove Library, which is to the northwest of central Brisbane, and also the closest Library to Paddington. Alongside this, the attached café and adjacent playground shown in the episode also exist in real life, albeit with some equipment changed in the playground.",
    "appearance": "Promises",
    "rooms": "Library interior, café, playground",
    "appearances": "Promises",
    "inhabitants": "Bandit, Chilli, Bluey, Bingo",
    "inconsistencies": "None",
    "trivia": "Ashgrove Library is known for its beautiful surroundings.",
    "gallery": "images/ashgrove_library.jpg"
  },
  {
    "locationName": "Moogerah Dam",
    "description": "In Grandad, Chilli, Bluey and Bingo visit their Grandad Mort who lives a distance from their suburban home. A chase ensues, with all four stopping at a lake with a view. This location is reminiscent of Lake Moogerah, which is located near Mount Edwards and is roughly an hour away from Brisbane. According to Costa Kassab (the art director for most episodes of Bluey), the episode also references photos taken at Carney's Creek Road and Creek Yarramalong, which are both roughly 10 km from Moogerah, plus Enoggera Reservoir which is just outside of Brisbane.",
    "appearance": "Grandad",
    "rooms": "Lake shore, viewing areas",
    "appearances": "Grandad",
    "inhabitants": "Bandit, Chilli, Bluey, Bingo",
    "inconsistencies": "None",
    "trivia": "Lake Moogerah is popular for fishing and boating.",
    "gallery": "images/moogerah_dam.jpg"
  },
  {
    "locationName": "The Myer Centre",
    "description": "In The Quiet Game, Bandit and his daughters need to buy a present for Muffin, and so head to a toy shop. The shop is located in a shopping centre which is accessed from street level by escalators. This is The Myer Centre which is located in Brisbane CBD with the entrance shown being that on Albert/Elizabeth Street crossroads. Additionally, in the background shot on what would be Albert Street are public gardens, these being The City Botanic Gardens in Brisbane, with The Concourse entrance being portrayed.",
    "appearance": "The Quiet Game",
    "rooms": "Shopping mall, escalators, toy store",
    "appearances": "The Quiet Game",
    "inhabitants": "Bandit, Bluey, Bingo",
    "inconsistencies": "None",
    "trivia": "The Myer Centre is a popular shopping location in Brisbane.",
    "gallery": "images/myer_centre.jpg"
  },
  {
    "locationName": "New Farm Park",
    "description": "In Spy Game, a gathering of Bluey and her friends take place in a riverside park. This park is based off New Farm Park located in Central Brisbane. The barbecue takes place on a public grill near the Brisbane Powerhouse (a power station that has been repurposed as a performing arts centre and community space). Bingo practices her ballet moves in the rotunda. They even have a very similar toilet block.",
    "appearance": "Spy Game",
    "rooms": "Park grounds, barbecue area, rotunda",
    "appearances": "Spy Game",
    "inhabitants": "Bluey, Bingo, Bandit",
    "inconsistencies": "None",
    "trivia": "New Farm Park is famous for its riverside views and community events.",
    "gallery": "images/new_farm_park.jpg"
  },

  {
    "locationName": "Noosa",
    "description": "In Piggyback, Heelers walk down the bank of the Noosa River. The holiday house is based on Twin Quays Noosa. They pass a pelican statue based on The Big Pelican. They pass two buildings with 'Jetski Hire' signs on the side; both appear to be based on U-Drive Boat Hire. Their journey ends at a river overlook at Gympie Terrace and Williams Street.",
    "appearance": "Piggyback",
    "rooms": "Holiday house, riverbank, jetski hire",
    "appearances": "Piggyback",
    "inhabitants": "Bandit, Chilli, Bluey, Bingo",
    "inconsistencies": "None",
    "trivia": "Noosa is a popular tourist destination for its beaches and outdoor activities.",
    "gallery": "images/noosa.jpg"
  },
  {
    "locationName": "Orleigh Park",
    "description": "In Seesaw, the kids play at a park featuring storybook murals and a custom frog-tongue slide. This is Orleigh Park in West End.",
    "appearance": "Seesaw",
    "rooms": "Park, playground, frog-tongue slide",
    "appearances": "Seesaw",
    "inhabitants": "Bluey, Bingo, Bandit, Chilli",
    "inconsistencies": "None",
    "trivia": "Orleigh Park is a popular park in West End, Brisbane, known for its riverside location and large play areas.",
    "gallery": "images/orleigh-park.jpg"
  },
  {
    "locationName": "Southbank Brisbane",
    "description": "In the episode Ice Cream, the entire episode is set away from The Heeler Household, focused instead on the SouthBank area of Brisbane. There are numerous locations shown of the site in the episode, such as The Streets Beach, an urban swimming site in SouthBank, and Aquativity. The Wheel of Brisbane and Queensland Performing Arts Centre (shown together) are also portrayed, as is The Arbour. To the end of the episode, a shot shows the three (Bandit with Bluey and Bingo under each arm) looking over a river for a city view. This is on Clem Jones Promenade next to The Brisbane River between The Victoria and Neville Bonner Bridges. The Heelers also watch the fireworks show in Bob Bilby from somewhere in Southbank.",
    "appearance": "Ice Cream, Bob Bilby",
    "rooms": "Streets Beach, Aquativity, Wheel of Brisbane, Queensland Performing Arts Centre, The Arbour",
    "appearances": "Ice Cream, Bob Bilby",
    "inhabitants": "Bandit, Bluey, Bingo",
    "inconsistencies": "None",
    "trivia": "Southbank is an iconic area in Brisbane known for its cultural venues, recreational areas, and scenic views along the Brisbane River.",
    "gallery": "images/southbank-brisbane.jpg"
  },
  {
    "locationName": "Toowong Cemetery",
    "description": "In Show And Tell, when Bandit ignored SatNav in order to teach Bluey and Bingo a lesson about doing what they’re told, they ended up at the Toowong Cemetery instead of their destination. Bingo lovingly referred to it as “Statue World.” It is the largest cemetery in Queensland, residing on the corner of Frederick Street and Mount Coot-tha Road. It is about four and a half kilometers west of Brisbane.",
    "appearance": "Show and Tell",
    "rooms": "Cemetery, memorials",
    "appearances": "Show and Tell",
    "inhabitants": "Bandit, Bluey, Bingo",
    "inconsistencies": "None",
    "trivia": "Toowong Cemetery is the largest cemetery in Queensland and is known for its historical significance and beautiful landscape.",
    "gallery": "images/toowong-cemetery.jpg"
  },
  {
    "locationName": "Wae Rebo",
    "description": "To the end of Curry Quest, Bandit is away from his family for six weeks, away on an archaeology trip. The village which is shown in a few brief shots is reminiscent of Wae Rebo village. The village located in Indonesia (about 500 km east of Bali) is famed for its ecotourism and its circular-cone houses. Joe Brumm's older brother worked as an archaeologist in the area briefly.",
    "appearance": "Curry Quest",
    "rooms": "Village, circular-cone houses",
    "appearances": "Curry Quest",
    "inhabitants": "Bandit",
    "inconsistencies": "None",
    "trivia": "Wae Rebo is a traditional village in Indonesia known for its distinctive, eco-friendly circular-cone houses.",
    "gallery": "images/wae-rebo.jpg"
  },
  {
    "locationName": "Wittonga Park",
    "description": "The birthday party in Cricket takes place at Wittonga Park in The Gap. This may also be the park from Lila's birthday party in Pass the Parcel and the unidentified party in Perfect.",
    "appearance": "Cricket, Pass the Parcel",
    "rooms": "Park, playground, party area",
    "appearances": "Cricket, Pass the Parcel",
    "inhabitants": "Bandit, Bluey, Bingo, Lila",
    "inconsistencies": "None",
    "trivia": "Wittonga Park is a local park in The Gap, Brisbane, and is a common venue for family events and parties.",
    "gallery": "images/wittonga-park.jpg"
  },
  {
    "locationName": "Woolcock Park",
    "description": "The park shown in Bike and Bob Bilby (and incidentally in Baby Race) is referenced from Woolcock Park in Red Hill.",
    "appearance": "Bike, Bob Bilby, Baby Race",
    "rooms": "Park, playground, bike track",
    "appearances": "Bike, Bob Bilby, Baby Race",
    "inhabitants": "Bluey, Bingo, Bandit, Chilli",
    "inconsistencies": "None",
    "trivia": "Woolcock Park in Red Hill is known for its family-friendly environment, featuring bike tracks and plenty of open space.",
    "gallery": "images/woolcock-park.jpg"
  },
  {
    "locationName": "Wynnum Whale Park",
    "description": "In Pass the Parcel, Buddy's birthday party is set at Wynnum Whale Park in Wynnum. It's a seaside playground with a nautical theme and several water features.",
    "appearance": "Pass the Parcel",
    "rooms": "Seaside playground, water features",
    "appearances": "Pass the Parcel",
    "inhabitants": "Buddy, Bluey, Bingo",
    "inconsistencies": "None",
    "trivia": "Wynnum Whale Park is a popular spot in Wynnum, Brisbane, featuring a giant whale sculpture and water-based play areas.",
    "gallery": "images/wynnum-whale-park.jpg"
  }
]
